-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: i11d101.p.ssafy.io    Database: o2o_dummy
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `o2o_dummy`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `o2o_dummy` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `o2o_dummy`;

--
-- Table structure for table `files`
--

DROP TABLE IF EXISTS `files`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `files` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `type` varchar(50) NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_USER_TO_FILES_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_FILES_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=81 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `files`
--

LOCK TABLES `files` WRITE;
/*!40000 ALTER TABLE `files` DISABLE KEYS */;
INSERT INTO `files` VALUES (2,1,'image/png','71c2be14-0cd9-4a78-a06f-aec20d5745a2_가위.png','2024-08-03 23:53:00'),(3,1,'image/png','b41f8b88-26f0-4b28-a71e-5b1958851981_가위.png','2024-08-04 00:34:06'),(4,1,'image/png','3135a056-8fb5-4264-a468-4ff1ec4c62e7_가위.png','2024-08-04 00:36:11'),(5,1,'image/png','e68dc290-5919-4907-adfb-440f5286e8c5_가위.png','2024-08-04 00:39:49'),(6,1,'image/png','7cff6051-23b1-41cf-ba93-a61babf9a527_가위.png','2024-08-04 00:40:40'),(7,1,'image/png','2b7e114b-e95d-4ad1-bac2-ce6c0eaca46e_가위.png','2024-08-04 00:49:28'),(8,1,'image/png','7ecb30b2-66b2-4b83-b4ab-84e54061cf69_가위.png','2024-08-04 01:48:54'),(9,1,'image/png','51e5a73e-c035-47fd-89d9-c4de18d10933_가위.png','2024-08-04 01:51:59'),(10,1,'image/png','fae737e2-d4d1-477a-a070-fa560ed032f2_가위.png','2024-08-04 02:22:13'),(11,1,'image/png','acad7832-01c0-4277-b432-d12756184bb5_가위.png','2024-08-04 02:33:17'),(12,1,'image/png','0c20a867-151f-4cce-80fd-89cb41e06ed5_가위.png','2024-08-04 02:37:26'),(13,1,'image/png','e94ca947-0fc0-4bbb-a756-2657502b16c3_가위.png','2024-08-04 02:42:31'),(14,1,'image/png','6d723483-8fe4-4688-b837-0e2799dc9ee5_가위.png','2024-08-04 02:48:13'),(15,1,'image/png','315b567f-e8a8-49ca-bc76-7eaf7fe83922_가위.png','2024-08-04 02:50:04'),(16,1,'image/png','42c15200-a625-4912-be5d-3b61d68a3e9e_가위.png','2024-08-04 02:50:40'),(17,1,'image/png','b87195d3-5fd5-41ab-a16a-a196de14bd0c_가위.png','2024-08-04 02:53:19'),(18,1,'image/png','82812ddd-956d-496f-9bba-450378bc8ab8_가위.png','2024-08-04 14:40:32'),(19,1,'image/png','8f72dc17-2110-4f9e-9b33-40f363d910e2_가위.png','2024-08-04 14:56:59'),(20,1,'image/png','a34f13f8-ab58-4c23-a2a3-6664c9fa29ec_가위.png','2024-08-04 16:07:54'),(21,1,'image/png','af2e989c-ce84-40c9-8e01-1d57b001b1fb_가위.png','2024-08-04 16:28:56'),(22,1,'image/png','8f72dc17-2110-4f9e-9b33-40f363d910e2_가위.png','2024-08-04 07:34:39'),(23,1,'image/png','a4f03958-edce-4e54-b5c9-e840dcfc4b2b_가위.png','2024-08-04 16:38:46'),(24,1,'image/webp','40a03e61-83b4-4c7d-9aeb-23d1a3d68861_eraser.webp','2024-08-04 16:39:15'),(25,1,'image/webp','14c1f57b-f0dc-4805-9619-ee36918fcafc_eraser.webp','2024-08-04 16:45:47'),(26,1,'image/png','c4e4ecf0-c770-442d-80c1-832ba8f426b8_가위.png','2024-08-04 16:45:48'),(27,1,'image/webp','8cefddbd-8e7d-44d6-ad7b-9781835b86e8_eraser.webp','2024-08-07 00:33:47'),(28,1,'image/png','35ba5e8b-a949-48ff-886d-9857afe47963_가위.png','2024-08-07 00:33:48'),(29,1,'image/png','9bacb741-ca28-43d7-b93a-caa609949276','2024-08-07 12:14:25'),(30,1,'image/png','71242a9d-0b61-46ac-b6c6-bc04f95b8721가위.png','2024-08-07 12:20:52'),(31,1,'image/png','a9509945-472e-42be-a42a-bcd05d3bc201가위.png','2024-08-07 12:24:54'),(32,1,'image/webp','8839258a-3180-4b64-ad03-b687da249791eraser.webp','2024-08-07 12:24:54'),(33,1,'image/png','b645199f-069b-4506-b710-84af9ddc54a2가위.png','2024-08-07 15:05:04'),(34,1,'image/webp','4f48ff67-9c50-47f3-98fa-de956693e22eeraser.webp','2024-08-07 15:05:04'),(35,1,'image/png','6f3db2ac-71c3-40e7-ba9b-4255a943e8e5가위.png','2024-08-07 15:13:17'),(36,1,'image/webp','1d65da86-3dfa-4121-bbf8-99ac21c86b89eraser.webp','2024-08-07 15:13:17'),(37,1,'image/png','b066e0c6-ba34-41ee-a033-baa23bb71f54가위.png','2024-08-07 15:14:25'),(38,1,'image/webp','a2e423c1-b54f-42db-8895-efe358a16168eraser.webp','2024-08-07 15:14:25'),(39,1,'image/png','c3373534-db5a-4080-8948-911db88368c8가위.png','2024-08-07 15:16:05'),(40,1,'image/webp','bcab0147-594c-471e-9f77-75a697f72f17eraser.webp','2024-08-07 15:16:05'),(41,7,'image/png','0d8a3ec3-5ecc-4365-9760-b93be87fa639_로고.png','2024-08-07 15:34:42'),(42,7,'image/png','6322a345-76c7-417c-89ed-0f47b808bbdb_로고.png','2024-08-07 15:37:36'),(43,7,'image/png','0509ed6d-c567-4731-af92-ba979759ff54_로고.png','2024-08-07 06:48:47'),(44,1,'image/png','6ecc62c7-b8c8-4559-a842-e57bda56c684가위.png','2024-08-07 15:57:28'),(45,1,'image/webp','c66d2c02-4cd5-473e-a9e0-b313d6ca1b3eeraser.webp','2024-08-07 15:57:28'),(46,7,'image/png','681305c4-dcbe-4930-af12-40365ceb2bdb로고.png','2024-08-08 03:21:06'),(47,7,'image/png','69257720-1165-41ac-87c3-93525b4d2152캡처.PNG','2024-08-08 08:58:48'),(48,7,'image/jpeg','7980ff5b-d0ca-41d4-92e0-ebf2ad102307예시이미지.jpeg','2024-08-08 15:30:28'),(49,7,'image/jpeg','8ea04d18-ea8e-4099-b9b0-a81c04f7dd13예시이미지.jpeg','2024-08-08 15:32:15'),(50,1,'image/png','7f01e0bf-ab23-4e65-9668-b84af9e254d6가위.png','2024-08-09 10:36:49'),(51,1,'image/png','f2ae7e71-8cbe-49a9-ae5e-6f767827a11d가위.png','2024-08-09 10:37:04'),(52,1,'image/png','be4020b6-c1d5-40ac-9544-995b46bc36ef가위.png','2024-08-09 10:39:55'),(53,1,'image/png','ac897824-ee2d-4855-b293-1a876b7dbb02가위.png','2024-08-09 11:05:17'),(54,1,'image/png','efca112c-863f-436e-81ad-08f470ac6027가위.png','2024-08-09 11:40:46'),(55,1,'image/png','30f61d73-8acc-47a4-aaa7-9cbf74668c20가위.png','2024-08-09 11:41:53'),(56,1,'image/png','d4b9185d-c218-44bd-a3ee-9db97480d293가위.png','2024-08-09 11:43:19'),(71,1,'image/webp','034d7ef6-3a26-446b-8694-989c30f28ca8eraser.webp','2024-08-11 22:51:17'),(72,1,'image/png','5ecf403b-989c-4ff4-b431-f6b28234da74가위.png','2024-08-11 22:51:17'),(73,1,'image/webp','507869d8-892e-41a1-9082-177043221d1eeraser.webp','2024-08-11 22:52:27'),(74,1,'image/png','86738f16-1c74-457c-bef9-d2bc1065d90b가위.png','2024-08-11 22:52:27'),(75,1,'image/webp','7ff5f9e0-49e5-48e6-a1de-d94a074ff672eraser.webp','2024-08-11 22:52:31'),(76,1,'image/png','f075caf0-e636-4bec-a4fe-cc951abaf743가위.png','2024-08-11 22:52:31'),(77,1,'image/webp','92d0337a-17f5-4d6e-b889-3ef06a50f8d1eraser.webp','2024-08-12 01:10:05'),(78,1,'image/png','6b054a0b-91dd-4f49-b8d6-7b66dff10a8d가위.png','2024-08-12 01:10:05'),(79,1,'image/webp','d1681ec4-dcd8-4a87-981c-f8281920c897eraser.webp','2024-08-12 01:16:30'),(80,1,'image/png','b3c11d4c-44ce-4361-ab7c-dc021f8259b6가위.png','2024-08-12 01:16:30');
/*!40000 ALTER TABLE `files` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker`
--

DROP TABLE IF EXISTS `locker`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker` (
  `locker_id` int NOT NULL AUTO_INCREMENT,
  `body_id` int NOT NULL,
  `product_id` int DEFAULT NULL,
  `row` tinyint NOT NULL,
  `column` tinyint NOT NULL,
  `is_usable` tinyint(1) NOT NULL DEFAULT '1',
  `product_cnt` smallint DEFAULT '0',
  `total_cnt` smallint DEFAULT '0',
  PRIMARY KEY (`locker_id`),
  KEY `FK_LOCKER_BODY_TO_LOCKER_1` (`body_id`),
  KEY `FK_PRODUCT_TO_LOCKER_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_BODY_TO_LOCKER_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`),
  CONSTRAINT `FK_PRODUCT_TO_LOCKER_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=167 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker`
--

LOCK TABLES `locker` WRITE;
/*!40000 ALTER TABLE `locker` DISABLE KEYS */;
INSERT INTO `locker` VALUES (1,1,1,1,1,0,0,27),(2,1,2,2,1,0,0,15),(3,1,3,3,1,0,6,25),(7,1,7,1,2,0,0,24),(8,1,8,2,2,0,10,26),(9,1,9,3,2,0,22,41),(13,1,13,1,3,0,0,27),(14,1,14,2,3,0,24,65),(15,1,76,3,3,0,0,62),(37,2,NULL,1,1,1,NULL,NULL),(38,2,4,2,1,0,2,30),(39,2,4,3,1,0,2,30),(45,2,95,1,2,0,2,30),(46,2,NULL,2,2,1,NULL,NULL),(47,2,NULL,3,2,1,NULL,NULL),(53,2,111,1,3,0,3,0),(54,2,130,2,3,0,2,0),(55,2,NULL,3,3,1,NULL,NULL),(69,3,NULL,1,1,1,NULL,NULL),(70,3,NULL,2,1,1,NULL,NULL),(71,3,NULL,3,1,1,NULL,NULL),(72,3,NULL,1,2,1,NULL,NULL),(73,3,NULL,2,2,1,NULL,NULL),(74,3,NULL,3,2,1,NULL,NULL),(75,3,NULL,1,3,1,NULL,NULL),(76,3,NULL,2,3,1,NULL,NULL),(77,3,NULL,3,3,1,NULL,NULL),(78,3,NULL,1,4,1,NULL,NULL),(79,3,NULL,2,4,1,NULL,NULL),(80,3,NULL,3,4,1,NULL,NULL),(81,3,NULL,1,5,1,NULL,NULL),(82,3,NULL,2,5,1,NULL,NULL),(83,3,NULL,3,5,1,NULL,NULL),(84,3,NULL,1,6,1,NULL,NULL),(85,3,NULL,2,6,1,NULL,NULL),(86,3,NULL,3,6,1,NULL,NULL),(87,4,NULL,1,1,1,NULL,NULL),(88,4,NULL,2,1,1,NULL,NULL),(89,4,NULL,3,1,1,NULL,NULL),(90,4,NULL,4,1,1,NULL,NULL),(91,4,NULL,5,1,1,NULL,NULL),(92,4,NULL,6,1,1,NULL,NULL),(93,4,NULL,7,1,1,NULL,NULL),(94,4,NULL,8,1,1,NULL,NULL),(95,4,NULL,9,1,1,NULL,NULL),(96,4,NULL,10,1,1,NULL,NULL),(97,4,NULL,11,1,1,NULL,NULL),(98,4,NULL,12,1,1,NULL,NULL),(99,4,NULL,1,2,1,NULL,NULL),(100,4,NULL,2,2,1,NULL,NULL),(101,4,NULL,3,2,1,NULL,NULL),(102,4,NULL,4,2,1,NULL,NULL),(103,4,NULL,5,2,1,NULL,NULL),(104,4,NULL,6,2,1,NULL,NULL),(105,4,NULL,7,2,1,NULL,NULL),(106,4,NULL,8,2,1,NULL,NULL),(107,4,NULL,9,2,1,NULL,NULL),(108,4,NULL,10,2,1,NULL,NULL),(109,4,NULL,11,2,1,NULL,NULL),(110,4,NULL,12,2,1,NULL,NULL),(111,4,NULL,1,3,1,NULL,NULL),(112,4,NULL,2,3,1,NULL,NULL),(113,4,NULL,3,3,1,NULL,NULL),(114,4,NULL,4,3,1,NULL,NULL),(115,4,NULL,5,3,1,NULL,NULL),(116,4,NULL,6,3,1,NULL,NULL),(117,4,134,7,3,0,2,0),(118,4,NULL,8,3,1,NULL,NULL),(119,4,NULL,9,3,1,NULL,NULL),(120,4,NULL,10,3,1,NULL,NULL),(121,4,NULL,11,3,1,NULL,NULL),(122,4,NULL,12,3,1,NULL,NULL),(123,4,NULL,1,4,1,NULL,NULL),(124,4,NULL,2,4,1,NULL,NULL),(125,4,NULL,3,4,1,NULL,NULL),(126,4,NULL,4,4,1,NULL,NULL),(127,4,NULL,5,4,1,NULL,NULL),(128,4,NULL,6,4,1,NULL,NULL),(129,4,NULL,7,4,1,NULL,NULL),(130,4,NULL,8,4,1,NULL,NULL),(131,4,NULL,9,4,1,NULL,NULL),(132,4,NULL,10,4,1,NULL,NULL),(133,4,NULL,11,4,1,NULL,NULL),(134,4,NULL,12,4,1,NULL,NULL),(135,4,NULL,1,5,1,NULL,NULL),(136,4,NULL,2,5,1,NULL,NULL),(137,4,NULL,3,5,1,NULL,NULL),(138,4,NULL,4,5,1,NULL,NULL),(139,4,NULL,5,5,1,NULL,NULL),(140,4,NULL,6,5,1,NULL,NULL),(141,4,NULL,7,5,1,NULL,NULL),(142,4,NULL,8,5,1,NULL,NULL),(143,4,NULL,9,5,1,NULL,NULL),(144,4,NULL,10,5,1,NULL,NULL),(145,4,NULL,11,5,1,NULL,NULL),(146,4,NULL,12,5,1,NULL,NULL),(147,4,NULL,1,6,1,NULL,NULL),(148,4,NULL,2,6,1,NULL,NULL),(149,4,NULL,3,6,1,NULL,NULL),(150,4,NULL,4,6,1,NULL,NULL),(151,4,NULL,5,6,1,NULL,NULL),(152,4,NULL,6,6,1,NULL,NULL),(153,4,NULL,7,6,1,NULL,NULL),(154,4,NULL,8,6,1,NULL,NULL),(155,4,NULL,9,6,1,NULL,NULL),(156,4,NULL,10,6,1,NULL,NULL),(157,4,NULL,11,6,1,NULL,NULL),(158,4,NULL,12,6,1,NULL,NULL),(159,5,17,1,1,0,5,5),(160,5,18,2,1,0,1,2),(161,5,19,1,2,0,4,5),(162,5,69,2,2,0,2,2),(163,6,NULL,1,1,1,0,0),(164,6,NULL,1,2,1,0,0),(165,6,NULL,1,3,1,0,0),(166,6,NULL,1,4,1,0,0);
/*!40000 ALTER TABLE `locker` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker_body`
--

DROP TABLE IF EXISTS `locker_body`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker_body` (
  `body_id` int NOT NULL AUTO_INCREMENT,
  `body_location` varchar(50) NOT NULL,
  `row` tinyint NOT NULL,
  `column` tinyint NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1',
  PRIMARY KEY (`body_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker_body`
--

LOCK TABLES `locker_body` WRITE;
/*!40000 ALTER TABLE `locker_body` DISABLE KEYS */;
INSERT INTO `locker_body` VALUES (1,'1층 로비',3,3,1),(2,'2층 복도',3,3,1),(3,'2층 휴게실',6,3,0),(4,'3층 회의실 근처',12,6,0),(5,'3층 IT 부서 앞',2,2,1),(6,'4층 강의실',4,1,1);
/*!40000 ALTER TABLE `locker_body` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `product_id` int NOT NULL AUTO_INCREMENT,
  `product_nm` varchar(255) DEFAULT NULL,
  `product_img` varchar(255) DEFAULT NULL,
  `product_det` varchar(255) DEFAULT NULL,
  `regist_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `user_id` int NOT NULL,
  PRIMARY KEY (`product_id`),
  KEY `FK_USER_TO_PRODUCT_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=158 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'노트북',NULL,'고성능 노트북','2024-07-23 01:27:44',1),(2,'키보드',NULL,'기계식 키보드','2024-07-23 01:27:44',2),(3,'마우스',NULL,'무선 마우스','2024-07-23 01:27:44',3),(4,'모니터',NULL,'27인치 모니터','2024-07-23 01:27:44',4),(5,'프린터',NULL,'레이저 프린터','2024-07-23 01:27:44',5),(6,'프로젝터',NULL,'고해상도 프로젝터','2024-07-23 01:27:44',1),(7,'USB 메모리',NULL,'64GB USB 메모리','2024-07-23 01:27:44',2),(8,'헤드셋',NULL,'노이즈 캔슬링 헤드셋','2024-07-23 01:27:44',3),(9,'웹캠',NULL,'Full HD 웹캠','2024-07-23 01:27:44',4),(10,'스피커',NULL,'블루투스 스피커','2024-07-23 01:27:44',5),(11,'충전기',NULL,'고속 충전기','2024-07-23 01:27:44',1),(12,'태블릿',NULL,'안드로이드 태블릿','2024-07-23 01:27:44',2),(13,'노트북 거치대',NULL,'알루미늄 노트북 거치대','2024-07-23 01:27:44',3),(14,'마우스패드',NULL,'대형 마우스패드','2024-07-23 01:27:44',4),(15,'외장하드',NULL,'2TB 외장하드','2024-07-23 01:27:44',5),(16,'책상 램프',NULL,'LED 책상 램프','2024-07-23 01:27:44',1),(17,'전동 드릴',NULL,'무선 전동 드릴','2024-07-23 01:27:44',2),(18,'케이블 정리함',NULL,'케이블 정리함','2024-07-23 01:27:44',3),(19,'네트워크 스위치',NULL,'8포트 네트워크 스위치','2024-07-23 01:27:44',4),(20,'무선 공유기',NULL,'Wi-Fi 6 무선 공유기','2024-07-23 01:27:44',5),(21,'보조 배터리',NULL,'20000mAh 보조 배터리','2024-07-23 01:27:44',1),(22,'스마트폰 거치대',NULL,'스마트폰 거치대','2024-07-23 01:27:44',2),(23,'마이크',NULL,'USB 마이크','2024-07-23 01:27:44',3),(24,'삼각대',NULL,'카메라 삼각대','2024-07-23 01:27:44',4),(25,'캠코더',NULL,'4K 캠코더','2024-07-23 01:27:44',5),(26,'스캐너',NULL,'문서 스캐너','2024-07-23 01:27:44',1),(27,'문서 세단기',NULL,'문서 세단기','2024-07-23 01:27:44',2),(28,'플로터',NULL,'대형 플로터','2024-07-23 01:27:44',3),(29,'비디오 프로젝터',NULL,'비디오 프로젝터','2024-07-23 01:27:44',4),(30,'회의용 스피커폰',NULL,'회의용 스피커폰','2024-07-23 01:27:44',5),(31,'디지털 카메라',NULL,'디지털 카메라','2024-07-23 01:27:44',1),(32,'헤드폰',NULL,'무선 헤드폰','2024-07-23 01:27:44',2),(33,'태블릿 키보드',NULL,'블루투스 태블릿 키보드','2024-07-23 01:27:44',3),(34,'프린터 잉크',NULL,'프린터 잉크','2024-07-23 01:27:44',4),(35,'휴대용 스캐너',NULL,'휴대용 스캐너','2024-07-23 01:27:44',5),(36,'HDMI 케이블',NULL,'고속 HDMI 케이블','2024-07-23 01:27:44',1),(37,'서지 프로텍터',NULL,'서지 프로텍터','2024-07-23 01:27:44',2),(38,'레이저 포인터',NULL,'레이저 포인터','2024-07-23 01:27:44',3),(39,'비디오 컨버터',NULL,'비디오 컨버터','2024-07-23 01:27:44',4),(40,'USB 허브',NULL,'USB 3.0 허브','2024-07-23 01:27:44',5),(41,'무선 마이크',NULL,'무선 마이크','2024-07-23 01:27:44',1),(42,'게임 컨트롤러',NULL,'무선 게임 컨트롤러','2024-07-23 01:27:44',2),(43,'캠핑 랜턴',NULL,'LED 캠핑 랜턴','2024-07-23 01:27:44',3),(44,'작업용 장갑',NULL,'작업용 장갑','2024-07-23 01:27:44',4),(45,'라벨 프린터',NULL,'라벨 프린터','2024-07-23 01:27:44',5),(46,'전동 공구 세트',NULL,'전동 공구 세트','2024-07-23 01:27:44',1),(47,'사운드바',NULL,'블루투스 사운드바','2024-07-23 01:27:44',2),(48,'스마트워치',NULL,'스마트워치','2024-07-23 01:27:44',3),(49,'지우개','물품 이미지 링크','잘 지워지는 지우개','2024-07-29 06:14:08',1),(51,'가위','가위.png','평범한 가위','2024-08-01 14:18:04',1),(52,'가위','가위.png','평범한 가위','2024-08-01 14:22:31',1),(53,'가위','가위.png','평범한 가위','2024-08-01 14:23:58',1),(54,'가위','가위.png','평범한 가위','2024-08-01 14:25:52',1),(55,'가위','34fa02f8-c721-47ba-8482-04bf0a62bb9e_가위.png','평범한 가위','2024-08-01 14:30:52',1),(56,'가위','b221a43b-e35c-4b9c-be72-57b6f1fa9b6e_가위.png','평범한 가위','2024-08-01 14:33:57',1),(57,'가위','d9d497de-7650-41e9-a248-7f1c118375dc_가위.png','평범한 가위','2024-08-01 14:36:41',1),(58,'가위','b8177688-698a-4d67-88e5-55762c06daa1_가위.png','평범한 가위','2024-08-01 14:36:50',1),(59,'가위','ace51a6d-de85-492f-9705-7bda8e2e8d2e_가위.png','평범한 가위','2024-08-01 14:38:35',1),(60,'지우개','e96b7900-e3dc-4ed2-b610-2faf4732d0df_가위.png','평범한 지우개','2024-08-02 13:22:33',1),(61,'지우개',NULL,'평범한 지우개','2024-08-02 13:23:02',1),(62,'지우개','857282da-68da-4b32-8516-47e59dcf7295_가위.png','평범한 지우개','2024-08-02 16:07:38',1),(63,'가위','040861ad-f9c2-4707-b7d9-98d940f52087_가위.png','평범한 가위','2024-08-03 00:16:49',1),(64,'마우스',NULL,'평범한 마우스','2024-08-03 23:53:00',1),(65,'가위',NULL,'평범한 가위','2024-08-04 00:31:48',1),(66,'가위',NULL,'평범한 가위','2024-08-04 00:34:06',1),(67,'가위',NULL,'평범한 가위','2024-08-04 00:36:11',1),(68,'가위',NULL,'평범한 가위','2024-08-04 00:39:49',1),(69,'가위',NULL,'평범한 가위','2024-08-04 00:40:40',1),(70,'지우개',NULL,'평범한 지우개','2024-08-04 00:45:39',1),(71,'지우개',NULL,'평범한 지우개','2024-08-04 00:47:31',1),(72,'지우개',NULL,'평범한 지우개','2024-08-04 00:49:23',1),(73,'가위',NULL,'평범한 가위','2024-08-04 00:49:28',1),(74,'가위',NULL,'평범한 가위','2024-08-04 01:48:53',1),(75,'가위',NULL,'평범한 가위','2024-08-04 01:51:59',1),(76,'가위',NULL,'평범한 가위','2024-08-04 02:22:09',1),(77,'가위',NULL,'평범한 가위','2024-08-04 02:22:13',1),(78,'가위',NULL,'평범한 가위','2024-08-04 02:33:17',1),(79,'가위',NULL,'평범한 가위','2024-08-04 02:37:26',1),(80,'가위',NULL,'평범한 가위','2024-08-04 02:42:31',1),(81,'가위',NULL,'평범한 가위','2024-08-04 02:48:13',1),(82,'가위',NULL,'평범한 가위','2024-08-04 02:50:03',1),(83,'가위',NULL,'평범한 가위','2024-08-04 02:50:40',1),(84,'가위',NULL,'평범한 가위','2024-08-04 02:53:19',1),(85,'지우개',NULL,'평범한 지우개','2024-08-04 02:53:22',1),(86,'가위',NULL,'평범한 가위','2024-08-04 14:40:32',1),(87,'지우개',NULL,'평범한 지우개','2024-08-04 14:56:55',1),(88,'가위',NULL,'평범한 가위','2024-08-04 14:56:59',1),(89,'가위',NULL,'평범한 가위','2024-08-04 16:07:54',1),(90,'가위',NULL,'평범한 가위','2024-08-04 16:28:56',1),(91,'가위',NULL,'평범한 가위','2024-08-04 16:38:46',1),(92,'가위',NULL,'평범한 가위','2024-08-04 16:39:15',1),(93,'가위',NULL,'평범한 가위','2024-08-04 16:44:58',1),(94,'가위',NULL,'평범한 가위','2024-08-04 16:45:47',1),(95,'에어팟',NULL,NULL,'2024-08-06 10:25:18',1),(97,'바위',NULL,'평범한 바위','2024-08-07 00:33:47',1),(98,'바위',NULL,'평범한 바위','2024-08-07 00:49:00',1),(99,'바위',NULL,'평범한 바위','2024-08-07 00:50:28',1),(100,'바위',NULL,'평범한 바위','2024-08-07 00:51:06',1),(101,'바위',NULL,'평범한 바위','2024-08-07 00:53:27',1),(102,'바위',NULL,'평범한 바위','2024-08-07 01:00:44',1),(103,'바위',NULL,'평범한 바위','2024-08-07 01:03:18',1),(104,'바위',NULL,'평범한 바위','2024-08-07 01:04:23',1),(105,'바위',NULL,'평범한 바위','2024-08-07 01:06:22',1),(106,'지우개',NULL,'평범한 지우개','2024-08-07 11:04:59',1),(107,'지우개',NULL,'평범한 지우개','2024-08-07 12:10:11',1),(109,'지우개',NULL,'평범한 지우개','2024-08-07 12:14:25',1),(111,'',NULL,NULL,'2024-08-07 03:20:15',1),(112,'지우개',NULL,'평범한 지우개','2024-08-07 12:20:51',1),(113,'지우개',NULL,'평범한 지우개','2024-08-07 12:24:54',1),(115,'지우개',NULL,'평범한 지우개','2024-08-07 05:04:29',1),(116,'지우개',NULL,'평범한 지우개','2024-08-07 15:05:04',1),(117,'지우개',NULL,'평범한 지우개','2024-08-07 15:05:04',1),(118,'지우개2',NULL,'평범한 지우개','2024-08-07 15:13:17',1),(119,'지우개2',NULL,'평범한 지우개','2024-08-07 15:13:18',1),(120,'2지우개2',NULL,'평범한 지우개','2024-08-07 15:14:25',1),(121,'2지우개2',NULL,'평범한 지우개','2024-08-07 15:14:25',1),(122,'3지우개2',NULL,'평범한 지우개','2024-08-07 15:16:05',1),(123,'카메라',NULL,'카메라입니다.','2024-08-07 15:34:42',7),(124,'카메라',NULL,'디지털 카메라입니다.','2024-08-07 15:37:36',7),(125,'연필 꽂이',NULL,'튼튼해요','2024-08-07 06:48:47',7),(127,'3지우개2',NULL,'평범한 지우개','2024-08-07 15:57:28',1),(130,'카메라',NULL,NULL,'2024-08-07 08:01:17',1),(131,'연필 꽂이',NULL,'연필도 같이 꽂아요','2024-08-08 03:21:06',7),(133,'ㅇ',NULL,'d','2024-08-08 08:58:48',7),(134,'카메라',NULL,NULL,'2024-08-08 13:42:41',1),(135,'1',NULL,'1','2024-08-08 15:30:28',7),(136,'12',NULL,'1','2024-08-08 15:32:15',7),(140,'개우지',NULL,'평범한 지우개','2024-08-09 11:05:17',1),(141,'개우지',NULL,'평범한 지우개','2024-08-09 11:40:46',1),(142,'개우지',NULL,'평범한 지우개','2024-08-09 11:41:53',1),(143,'개우지',NULL,'평범한 지우개','2024-08-09 11:43:19',1),(151,'가위',NULL,'평범한 바위','2024-08-11 22:51:17',1),(152,'ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ',NULL,'평범한 바위','2024-08-11 22:52:27',1),(153,'ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ',NULL,'평범한 바위','2024-08-11 22:52:31',1),(154,'ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ',NULL,'평범한 바위','2024-08-12 01:10:05',1),(155,'바위',NULL,'평범한 바위','2024-08-12 01:16:30',1),(156,'바위',NULL,'평범한 바위','2024-08-12 01:17:58',1);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_imgs`
--

DROP TABLE IF EXISTS `product_imgs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_imgs` (
  `product_id` int NOT NULL,
  `file_id` int NOT NULL,
  PRIMARY KEY (`product_id`,`file_id`),
  KEY `FK_FILES_TO_PRODUCT_IMAGES_1` (`file_id`),
  CONSTRAINT `FK_FILES_TO_PRODUCT_IMAGES_1` FOREIGN KEY (`file_id`) REFERENCES `files` (`id`),
  CONSTRAINT `FK_PRODUCT_TO_PRODUCT_IMAGES_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_imgs`
--

LOCK TABLES `product_imgs` WRITE;
/*!40000 ALTER TABLE `product_imgs` DISABLE KEYS */;
INSERT INTO `product_imgs` VALUES (140,53),(141,54),(142,55),(143,56),(151,71),(151,72),(152,73),(152,74),(153,75),(153,76),(154,77),(154,78),(155,79),(155,80);
/*!40000 ALTER TABLE `product_imgs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_req`
--

DROP TABLE IF EXISTS `product_req`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_req` (
  `req_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `product_nm` varchar(255) DEFAULT NULL,
  `req_url` varchar(255) DEFAULT NULL,
  `product_cnt` int DEFAULT NULL,
  `req_content` varchar(255) DEFAULT NULL,
  `req_dt` datetime(6) DEFAULT NULL,
  `is_approved` tinyint(1) DEFAULT '0',
  `is_rejected` tinyint(1) DEFAULT '0',
  `reject_cmt` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`req_id`),
  KEY `FK_USER_TO_PRODUCT_REQ_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_REQ_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_req`
--

LOCK TABLES `product_req` WRITE;
/*!40000 ALTER TABLE `product_req` DISABLE KEYS */;
INSERT INTO `product_req` VALUES (21,7,'노트북',NULL,1,'신규 프로젝트 시작으로 고성능 노트북이 필요합니다. 16GB RAM, 512GB SSD 사양 요청드립니다.','2024-07-15 00:00:00.000000',1,0,NULL),(22,8,'모니터',NULL,2,'디자인 작업 효율을 위해 27인치 4K 해상도 모니터 2대를 신청합니다. 색 정확도가 높은 모델로 부탁드립니다.','2024-07-16 00:00:00.000000',1,0,NULL),(23,9,'키보드',NULL,1,'장시간 타이핑으로 인한 손목 통증 예방을 위해 인체공학 분리형 키보드를 요청합니다.','2024-07-17 00:00:00.000000',1,0,NULL),(24,6,'마우스',NULL,1,'그래픽 작업용 고정밀 무선 마우스가 필요합니다. DPI 조절 기능이 있는 모델로 부탁드립니다.','2024-07-18 00:00:00.000000',1,0,NULL),(25,10,'헤드셋',NULL,1,'고객 상담 품질 향상을 위해 노이즈 캔슬링 기능이 탑재된 프리미엄 헤드셋을 신청합니다.','2024-07-19 00:00:00.000000',1,0,NULL),(26,7,'외장하드',NULL,1,'대용량 프로젝트 파일 백업을 위해 4TB 용량의 암호화 지원 외장하드가 필요합니다.','2024-07-20 00:00:00.000000',1,0,NULL),(27,8,'웹캠',NULL,1,'해외 클라이언트와의 화상회의 품질 개선을 위해 4K 해상도 지원 웹캠을 요청드립니다.','2024-07-21 00:00:00.000000',1,0,NULL),(28,9,'프린터',NULL,1,'부서 문서 작업을 위해 양면 인쇄, 스캔, 복사 기능을 갖춘 컬러 레이저 복합기를 신청합니다.','2024-07-22 00:00:00.000000',1,0,NULL),(29,6,'스탠드',NULL,1,'목과 어깨 통증 완화를 위해 높이와 각도 조절이 가능한 듀얼 모니터용 스탠드를 요청합니다.','2024-07-23 00:00:00.000000',1,0,NULL),(30,10,'도킹스테이션',NULL,1,'재택근무 시 업무 효율성을 위해 다중 포트 지원 USB-C 도킹스테이션이 필요합니다.','2024-07-24 00:00:00.000000',1,0,NULL),(31,7,'게이밍의자',NULL,1,'장시간 앉아있어 허리가 아픕니다.','2024-07-25 00:00:00.000000',0,1,'일반 의자로 대체 가능합니다.'),(32,8,'태블릿',NULL,1,'외근시 사용하고자 합니다.','2024-07-26 00:00:00.000000',0,1,'노트북으로 충분합니다.'),(33,9,'커피머신',NULL,1,'사무실 분위기 개선을 위해 신청합니다.','2024-07-27 00:00:00.000000',0,1,'예산 초과로 인해 거절됩니다.'),(34,6,'VR헤드셋',NULL,1,'새로운 프로젝트 테스트용입니다.','2024-07-28 00:00:00.000000',0,1,'현재 프로젝트와 무관합니다.'),(35,10,'전동책상',NULL,1,'건강을 위해 서서 일하고 싶습니다.','2024-07-29 00:00:00.000000',0,1,'기존 책상 사용 바랍니다.'),(36,7,'스마트보드',NULL,1,'회의실용 스마트보드 요청드립니다.','2024-07-30 00:00:00.000000',1,0,NULL),(37,8,'문서세단기',NULL,1,'기밀문서 처리용으로 필요합니다.','2024-07-31 00:00:00.000000',1,0,NULL),(38,9,'빔프로젝터',NULL,1,'프레젠테이션용으로 신청합니다.','2024-08-01 00:00:00.000000',0,1,NULL),(39,6,'공기청정기',NULL,2,'사무실 공기질 개선을 위해 요청드립니다.','2024-08-02 00:00:00.000000',0,1,NULL),(40,10,'서버랙',NULL,1,'신규 서버 구축을 위해 필요합니다.','2024-08-03 00:00:00.000000',1,0,NULL),(41,1,'물품명','사이트 주소',1,'사유',NULL,1,0,NULL),(42,1,'물품명','사이트 주소',1,'사유','2024-07-25 15:42:00.000000',1,0,NULL),(43,1,'물품명','사이트 주소',22,'사유','2024-07-25 15:44:00.000000',1,0,NULL),(44,1,'물품명','사이트 주소',22,'사유','2024-07-25 15:45:25.000000',0,0,NULL),(45,1,'물품명','사이트 주소',22,'사유','2024-07-25 15:45:44.000000',1,0,NULL),(46,1,'물품명','사이트 주소',22,'사유','2024-07-25 16:25:29.000000',1,0,NULL),(47,1,'물품명','사이트 주소',22,'사유','2024-07-25 17:30:30.000000',0,0,NULL),(48,1,'물품명','사이트 주소',22,'사유','2024-07-25 17:30:55.000000',0,0,NULL),(51,1,'물품명','사이트 주소',22,'사유','2024-07-26 10:39:15.000000',0,1,'거절 이유'),(52,1,'물품명22','사이트 주소',22,'사유','2024-07-26 14:28:28.000000',1,0,NULL),(53,2,'물품명2','사이트 주소',30,'사유','2024-07-26 15:07:05.000000',0,0,NULL),(54,2,'물품명2','사이트 주소',30,'사유','2024-07-29 10:57:59.000000',0,1,NULL),(55,10,'건전지','https://www.gmarket.co.kr/',150,'gmarket에서 건전지 사주세요','2024-08-02 13:26:30.688689',1,0,'승인 이유'),(56,10,'건전지','https://www.gmarket.co.kr/',150,'gmarket에서 건전지 사주세요','2024-08-03 00:11:56.769418',1,0,'승인 이유'),(57,7,NULL,NULL,NULL,NULL,'2024-08-05 15:35:22.471881',0,0,NULL),(58,7,NULL,NULL,NULL,NULL,'2024-08-05 15:38:53.802949',0,0,NULL),(59,7,NULL,NULL,NULL,NULL,'2024-08-05 15:39:49.342383',0,0,NULL);
/*!40000 ALTER TABLE `product_req` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_rpt`
--

DROP TABLE IF EXISTS `product_rpt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_rpt` (
  `rpt_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `product_id` int NOT NULL,
  `product_cnt` smallint DEFAULT '0',
  `rpt_content` varchar(1000) DEFAULT NULL,
  `rpt_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `rpt_img` varchar(255) DEFAULT NULL,
  `is_processed` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`rpt_id`),
  KEY `FK_USER_TO_PRODUCT_RPT_1` (`user_id`),
  KEY `FK_LOCKER_TO_PRODUCT_RPT_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` (`status_id`),
  KEY `FK_PRODUCT_TO_PRODUCT_RPT_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_TO_PRODUCT_RPT_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_PRODUCT_RPT_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_RPT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_rpt`
--

LOCK TABLES `product_rpt` WRITE;
/*!40000 ALTER TABLE `product_rpt` DISABLE KEYS */;
INSERT INTO `product_rpt` VALUES (1,7,1,6,1,1,'분실','2024-06-03 17:30:00',NULL,1),(2,10,14,6,14,1,'분실함','2024-06-16 09:15:00',NULL,1),(3,7,2,7,2,1,'쪼금 부서짐','2024-06-03 17:30:00',NULL,1),(4,8,161,7,19,1,'작동이 안돼여','2024-07-03 16:45:00',NULL,1),(5,1,1,4,1,NULL,'세부 사항','2024-07-29 01:28:38','물품 이미지 경로',1),(6,1,1,4,1,NULL,'세부 사항','2024-07-29 09:53:43','물품 이미지 경로',1),(7,1,1,4,1,NULL,'세부 사항','2024-07-29 10:01:57','물품 이미지 경로',1),(8,1,1,4,1,NULL,'세부 사항','2024-07-29 10:25:05','물품 이미지 경로',1),(9,1,1,4,1,NULL,'세부 사항','2024-07-29 10:32:27','물품 이미지 경로',1),(10,1,1,4,1,NULL,'세부 사항','2024-07-29 10:34:00','물품 이미지 경로',1),(11,1,1,4,1,NULL,'세부 사항','2024-07-29 10:36:00','물품 이미지 경로',1),(12,5,1,4,1,NULL,'세부 사항','2024-07-29 10:38:27','물품 이미지 경로',1),(13,5,1,4,1,NULL,'세부 사항','2024-07-29 10:44:43','물품 이미지 경로',1),(14,5,1,4,1,NULL,'세부 사항','2024-07-29 10:45:29','물품 이미지 경로',1),(15,5,1,4,1,NULL,'세부 사항','2024-07-29 10:50:40','물품 이미지 경로',1),(16,5,1,4,1,NULL,'세부 사항','2024-07-29 10:51:19','물품 이미지 경로',NULL),(17,5,1,4,1,NULL,'세부 사항','2024-07-29 10:53:37','물품 이미지 경로',NULL),(18,5,1,4,1,1,'세부 사항','2024-07-29 13:27:13','물품 이미지 경로',NULL),(19,5,2,4,1,1,'세부 사항','2024-07-29 13:42:13','물품 이미지 경로',NULL),(20,5,2,4,1,1,'세부 사항','2024-07-29 13:44:02','물품 이미지 경로',NULL),(21,5,2,4,1,1,'세부 사항','2024-07-29 13:47:34','물품 이미지 경로',NULL),(22,5,2,4,1,1,'세부 사항','2024-07-29 13:48:10','물품 이미지 경로',NULL),(23,5,2,4,1,1,'세부 사항','2024-07-29 13:49:05','물품 이미지 경로',NULL),(24,5,2,4,1,1,'세부 사항','2024-07-29 13:51:09','물품 이미지 경로',0),(25,1,1,4,1,1,'세부 사항','2024-08-01 12:48:19','물품 이미지 경로',1),(26,1,1,4,1,1,'세부 사항','2024-08-02 10:16:52','물품 이미지 경로',1),(27,1,1,4,1,1,'세부 사항','2024-08-02 12:39:33','물품 이미지 경로',0),(28,4,8,4,8,1,'여기 물건 부서졌어요','2024-08-02 13:37:02','물품 이미지 경로',1),(29,4,8,4,8,1,'여기 물건 분실 했어요!','2024-08-02 14:47:06','물품 이미지 경로',1),(30,4,8,4,8,1,'여기 물건 분실 했어요!','2024-08-02 14:47:21','물품 이미지 경로',0),(31,4,8,4,8,1,'여기 물건 부서졌어요','2024-08-03 17:20:04','물품 이미지 경로',0),(32,4,9,7,9,2,'세부 사항','2024-08-03 17:23:08','물품 이미지',0),(33,4,9,7,9,2,'세부 사항','2024-08-03 17:23:23','물품 이미지',0),(34,4,9,7,9,2,'세부 사항','2024-08-04 05:02:30','물품 이미지',1),(35,4,3,7,3,3,'세부 사항','2024-08-04 10:39:08','물품 이미지',1),(36,4,3,7,3,3,'세부 사항','2024-08-05 05:58:38','물품 이미지',0),(37,4,3,7,3,3,'세부 사항','2024-08-05 06:26:23','물품 이미지',0),(38,4,3,4,3,3,'세부 사항','2024-08-05 07:29:05','물품 이미지',0),(39,4,3,4,3,3,'세부 사항','2024-08-05 07:33:42','물품 이미지',0),(40,4,3,4,3,3,'세부 사항','2024-08-07 04:03:14','물품 이미지',0),(41,4,3,4,3,3,'세부 사항','2024-08-07 04:03:42','물품 이미지',0),(42,4,7,4,7,2,'세부 사항','2024-08-07 04:14:16','물품 이미지',0),(43,4,3,4,3,3,'세부 사항','2024-08-07 12:42:10','물품 이미지',0),(44,4,3,7,3,3,'세부 사항','2024-08-07 15:51:46','물품 이미지',0),(45,4,9,4,9,1,'세부 사항','2024-08-08 03:42:01','물품 이미지',0),(46,4,8,4,8,1,'여기 물건 분실 했어요!','2024-08-08 15:03:15','물품 이미지 경로',0),(47,7,7,4,7,2,'세부 사항','2024-08-08 07:35:52','물품 이미지',0),(48,7,3,4,3,3,'세부 사항','2024-08-08 08:09:43','물품 이미지',0),(49,7,3,4,3,3,'세부 사항','2024-08-08 08:21:11','물품 이미지',0),(50,7,3,4,3,3,'세부 사항','2024-08-09 00:31:57','물품 이미지',0),(51,7,3,7,3,3,'세부 사항','2024-08-09 00:40:37','물품 이미지',0),(52,7,3,4,3,3,'세부 사항','2024-08-09 00:50:14','물품 이미지',0),(53,7,3,4,3,3,'세부 사항','2024-08-09 00:52:50','물품 이미지',0),(54,7,3,4,3,3,'세부 사항','2024-08-09 01:00:22','물품 이미지',0),(55,7,7,4,7,2,'세부 사항','2024-08-09 01:07:36','물품 이미지',0),(56,7,7,4,7,2,'세부 사항','2024-08-09 01:30:44','물품 이미지',0),(57,4,9,4,9,2,'세부 사항','2024-08-09 01:43:42','물품 이미지',0),(58,4,9,4,9,1,'세부 사항','2024-08-09 07:33:05','물품 이미지',0),(59,4,9,4,9,2,'세부 사항','2024-08-09 07:41:48','물품 이미지',0),(60,4,9,4,9,2,'세부 사항','2024-08-09 07:56:53','물품 이미지',0),(61,4,9,4,9,2,'세부 사항','2024-08-09 08:18:37','물품 이미지',0),(62,4,9,4,9,2,'세부 사항','2024-08-11 07:58:40','물품 이미지',0),(63,4,7,4,7,1,'세부 사항','2024-08-12 12:23:54','물품 이미지',0),(64,4,7,4,7,1,'세부 사항','2024-08-12 12:24:25','물품 이미지',0),(65,4,7,4,7,1,'세부 사항','2024-08-12 12:25:17','물품 이미지',0),(66,4,7,4,7,1,'세부 사항','2024-08-13 00:52:25','물품 이미지',0),(67,4,7,4,7,1,'세부 사항','2024-08-13 01:01:44','물품 이미지',0),(68,1,3,4,3,1,'여기 물건 분실 했어요!','2024-08-13 14:30:22',NULL,0),(69,1,3,4,3,1,'여기 물건 분실 했어요!','2024-08-13 14:31:40',NULL,0),(70,4,15,4,76,1,'세부 사항','2024-08-13 15:14:05','물품 이미지',0),(71,4,3,4,3,2,'세부 사항','2024-08-13 15:14:05','물품 이미지',0),(72,4,15,4,76,1,'세부 사항','2024-08-14 00:24:01','물품 이미지',0),(73,4,3,4,3,1,'세부 사항','2024-08-14 00:24:01','물품 이미지',0),(74,4,2,4,2,1,'세부 사항','2024-08-14 00:32:05','물품 이미지',0),(75,4,1,4,1,1,'세부 사항','2024-08-14 00:32:05','물품 이미지',0),(76,30,7,4,7,1,'세부 사항','2024-08-14 01:17:20','물품 이미지',0),(77,30,8,7,8,1,'세부 사항','2024-08-14 01:17:20','물품 이미지',0),(78,4,14,6,14,1,'세부 사항','2024-08-14 03:49:26','물품 이미지',0),(79,4,1,6,1,2,'세부 사항','2024-08-14 03:49:26','물품 이미지',0),(80,4,14,6,14,1,'세부 사항','2024-08-14 03:50:03','물품 이미지',0),(81,30,15,6,76,1,'세부 사항','2024-08-14 04:32:20','물품 이미지',0),(82,30,15,6,76,1,'세부 사항','2024-08-14 06:04:07','물품 이미지',0),(83,30,15,6,76,1,'세부 사항','2024-08-14 15:38:48','물품 이미지',0),(84,30,7,6,7,1,'세부 사항','2024-08-14 15:39:24','물품 이미지',0),(85,30,7,6,7,1,'세부 사항','2024-08-14 16:28:50','물품 이미지',0),(86,30,7,6,7,1,'세부 사항','2024-08-15 05:35:34','물품 이미지',0);
/*!40000 ALTER TABLE `product_rpt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_status`
--

DROP TABLE IF EXISTS `product_status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_status` (
  `status_id` tinyint NOT NULL,
  `status_nm` varchar(10) NOT NULL COMMENT '분류(1. 대여 2. 예약 3. 배부 4. 등록 5. 수리 6. 분실 7. 파손)',
  PRIMARY KEY (`status_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_status`
--

LOCK TABLES `product_status` WRITE;
/*!40000 ALTER TABLE `product_status` DISABLE KEYS */;
INSERT INTO `product_status` VALUES (1,'대여'),(2,'예약'),(3,'배부'),(4,'등록'),(5,'수리'),(6,'분실'),(7,'파손'),(8,'반납'),(9,'예약취소'),(10,'예약만료');
/*!40000 ALTER TABLE `product_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent`
--

DROP TABLE IF EXISTS `rent`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent` (
  `rent_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `reserve_id` int DEFAULT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `end_dt` datetime DEFAULT NULL,
  `is_returned` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`rent_id`),
  KEY `FK_USER_TO_RENT_1` (`user_id`),
  KEY `FK_RESERVE_TO_RENT_1` (`reserve_id`),
  CONSTRAINT `FK_RESERVE_TO_RENT_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RENT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=250 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent`
--

LOCK TABLES `rent` WRITE;
/*!40000 ALTER TABLE `rent` DISABLE KEYS */;
INSERT INTO `rent` VALUES (1,6,9,'2024-07-23 13:27:00','2024-07-26 13:27:00','2024-07-24 06:58:00',1),(2,7,10,'2024-07-23 16:11:00','2024-07-26 16:11:00','2024-08-09 01:32:13',1),(3,8,11,'2024-07-23 17:22:00','2024-07-26 17:22:00','2024-07-23 19:15:00',1),(4,9,12,'2024-07-23 16:19:00','2024-07-26 16:19:00',NULL,0),(5,7,NULL,'2024-06-01 08:00:00','2024-06-04 08:00:00','2024-06-03 17:30:00',1),(6,8,NULL,'2024-06-05 10:30:00','2024-06-08 10:30:00','2024-06-08 09:45:00',1),(7,9,NULL,'2024-06-10 13:00:00','2024-06-13 13:00:00','2024-06-13 11:30:00',1),(8,10,NULL,'2024-06-15 15:30:00','2024-06-18 15:30:00','2024-06-16 09:15:00',1),(9,6,NULL,'2024-06-20 09:00:00','2024-06-23 09:00:00','2024-06-23 08:45:00',1),(10,7,NULL,'2024-06-25 11:30:00','2024-06-28 11:30:00','2024-06-28 10:15:00',1),(11,8,NULL,'2024-07-01 14:00:00','2024-07-04 14:00:00','2024-07-03 16:45:00',1),(12,9,NULL,'2024-07-05 16:30:00','2024-07-08 16:30:00','2024-07-08 15:00:00',1),(14,4,NULL,'2024-07-30 13:52:40','2024-08-02 13:52:40',NULL,1),(15,4,NULL,'2024-07-30 13:55:44','2024-08-02 13:55:44','2024-08-06 15:00:00',1),(16,4,NULL,'2024-07-30 13:56:25','2024-08-02 13:56:25',NULL,0),(18,4,NULL,'2024-07-30 13:59:11','2024-08-02 13:59:11',NULL,0),(19,4,NULL,'2024-07-30 13:59:50','2024-08-02 13:59:50',NULL,0),(20,4,NULL,'2024-07-30 14:05:48','2024-08-02 14:05:48','2024-08-09 07:32:11',1),(21,4,NULL,'2024-07-30 14:17:48','2024-08-02 14:17:48','2024-08-11 07:45:59',1),(22,4,NULL,'2024-07-30 14:18:26','2024-08-02 14:18:26','2024-08-11 08:48:08',1),(23,4,NULL,'2024-07-30 14:19:25','2024-08-02 14:19:25','2024-08-12 13:28:42',1),(24,4,NULL,'2024-07-30 14:20:21','2024-08-02 14:20:21','2024-08-12 15:25:33',1),(25,4,NULL,'2024-07-30 14:23:00','2024-08-02 14:23:00','2024-08-04 09:01:36',1),(27,4,NULL,'2024-07-30 14:25:32','2024-08-02 14:25:32','2024-08-04 09:01:21',1),(28,4,NULL,'2024-07-30 14:27:08','2024-08-02 14:27:08','2024-08-04 09:31:36',1),(29,4,NULL,'2024-07-30 14:27:35','2024-08-02 14:27:35','2024-08-04 09:31:38',1),(30,4,NULL,'2024-07-30 14:28:16','2024-08-02 14:28:16','2024-08-04 09:31:55',1),(31,4,NULL,'2024-07-30 14:29:09','2024-08-02 14:29:09','2024-08-04 09:31:58',1),(32,4,NULL,'2024-07-30 14:29:34','2024-08-02 14:29:34','2024-08-04 09:32:00',1),(33,4,NULL,'2024-07-30 14:31:31','2024-08-02 14:31:31','2024-08-04 09:32:54',1),(34,4,NULL,'2024-07-30 14:32:22','2024-08-02 14:32:22','2024-08-04 09:32:57',1),(35,4,NULL,'2024-07-30 14:32:53','2024-08-02 14:32:53','2024-08-04 09:32:59',1),(36,4,NULL,'2024-07-30 14:35:01','2024-08-02 14:35:01','2024-08-12 13:29:15',1),(37,4,NULL,'2024-07-30 14:38:26','2024-08-02 14:38:26',NULL,0),(38,4,NULL,'2024-07-30 14:39:02','2024-08-02 14:39:02',NULL,0),(39,4,NULL,'2024-07-30 14:39:34','2024-08-02 14:39:34',NULL,0),(40,4,NULL,'2024-07-30 14:44:27','2024-08-02 14:44:27','2024-08-11 08:49:41',1),(41,4,NULL,'2024-07-30 14:45:09','2024-08-02 14:45:09',NULL,0),(42,4,NULL,'2024-07-31 12:44:06','2024-08-03 12:44:06',NULL,0),(43,4,NULL,'2024-08-01 12:55:34','2024-08-04 12:55:34','2024-08-02 10:11:03',1),(44,4,NULL,'2024-08-02 10:03:40','2024-08-05 10:03:40','2024-08-02 10:11:13',1),(45,4,NULL,'2024-08-02 10:09:27','2024-08-05 10:09:27','2024-08-02 10:11:13',1),(46,4,NULL,'2024-08-02 13:12:17','2024-08-05 13:12:17',NULL,0),(47,4,NULL,'2024-08-02 13:17:23','2024-08-05 13:17:23','2024-08-02 13:19:36',1),(48,4,NULL,'2024-08-02 16:55:19','2024-08-05 16:55:19','2024-08-12 15:25:54',1),(49,30,NULL,'2024-08-04 09:39:50','2024-08-07 09:39:50','2024-08-14 01:35:04',0),(50,7,NULL,'2024-08-04 10:16:37','2024-08-07 10:16:37','2024-08-08 06:43:10',1),(51,4,NULL,'2024-08-08 15:03:02','2024-08-11 15:03:02','2024-08-12 15:26:12',1),(52,4,34,'2024-08-09 04:46:15','2024-08-12 04:46:15',NULL,0),(53,4,34,'2024-08-09 05:09:30','2024-08-12 05:09:30',NULL,0),(54,4,34,'2024-08-09 05:11:17','2024-08-12 05:11:17',NULL,0),(56,4,34,'2024-08-09 05:27:48','2024-08-12 05:27:48',NULL,0),(57,4,34,'2024-08-09 05:28:23','2024-08-12 05:28:23',NULL,0),(58,4,34,'2024-08-09 05:52:26','2024-08-12 05:52:26',NULL,0),(59,6,51,'2024-08-09 14:58:45','2024-08-12 14:58:45',NULL,0),(60,6,52,'2024-08-09 15:01:36','2024-08-12 15:01:36',NULL,0),(61,70,34,'2024-08-09 06:38:01','2024-08-12 06:38:01',NULL,0),(62,70,34,'2024-08-09 06:39:58','2024-08-12 06:39:58',NULL,0),(63,6,NULL,'2024-08-09 06:46:59','2024-08-12 06:46:59',NULL,0),(64,70,34,'2024-08-09 08:31:52','2024-08-12 08:31:52',NULL,0),(65,4,NULL,'2024-08-10 14:55:04','2024-08-13 14:55:04',NULL,0),(68,4,34,'2024-08-11 03:21:06','2024-08-14 03:21:06',NULL,0),(69,7,34,'2024-08-11 07:27:14','2024-08-14 07:27:14',NULL,0),(70,7,34,'2024-08-11 07:28:16','2024-08-14 07:28:16',NULL,0),(71,4,34,'2024-08-11 07:45:12','2024-08-14 07:45:12',NULL,0),(72,4,34,'2024-08-11 07:56:57','2024-08-14 07:56:57',NULL,0),(73,4,34,'2024-08-11 09:04:29','2024-08-14 09:04:29','2024-08-14 03:50:03',1),(74,4,34,'2024-08-12 00:07:08','2024-08-15 00:07:08',NULL,0),(75,4,34,'2024-08-12 02:02:02','2024-08-15 02:02:02','2024-08-14 00:32:05',1),(76,4,34,'2024-08-12 02:03:09','2024-08-15 02:03:09','2024-08-14 00:32:05',1),(77,4,34,'2024-08-12 02:20:17','2024-08-15 02:20:17','2024-08-14 03:49:26',1),(78,4,34,'2024-08-12 07:53:05','2024-08-15 07:53:05','2024-08-14 00:24:01',1),(79,4,34,'2024-08-12 08:43:40','2024-08-15 08:43:40','2024-08-13 16:02:08',1),(80,4,34,'2024-08-12 12:13:12','2024-08-15 12:13:12','2024-08-13 15:58:29',1),(81,4,34,'2024-08-12 12:14:09','2024-08-15 12:14:09','2024-08-13 15:52:56',1),(82,4,34,'2024-08-13 01:34:00','2024-08-16 01:34:00','2024-08-13 15:14:05',1),(83,30,34,'2024-08-13 16:12:56','2024-08-16 16:12:56','2024-08-13 16:13:48',1),(84,4,NULL,'2024-08-13 08:40:13','2024-08-16 08:40:13',NULL,0),(85,30,NULL,'2024-08-13 10:27:15','2024-08-16 10:27:15','2024-08-14 01:17:20',1),(86,4,NULL,'2024-08-13 12:07:02','2024-08-16 12:07:02','2024-08-14 00:24:01',1),(87,4,NULL,'2024-08-13 12:19:58','2024-08-16 12:19:58','2024-08-13 15:14:05',1),(98,6,NULL,'2024-08-14 10:39:06','2024-08-17 10:39:06',NULL,0),(99,30,NULL,'2024-08-14 10:39:46','2024-08-17 10:39:46','2024-08-14 10:42:19',1),(103,30,NULL,'2024-08-14 04:14:53','2024-08-17 04:14:53',NULL,0),(104,30,NULL,'2024-08-14 04:15:05','2024-08-17 04:15:05',NULL,0),(105,30,NULL,'2024-08-14 04:27:28','2024-08-17 04:27:28',NULL,0),(106,30,NULL,'2024-08-14 04:29:59','2024-08-17 04:29:59','2024-08-14 04:32:20',1),(107,30,NULL,'2024-08-14 04:40:01','2024-08-17 04:40:01',NULL,0),(108,30,NULL,'2024-08-14 04:59:55','2024-08-17 04:59:55',NULL,0),(109,30,NULL,'2024-08-14 05:01:40','2024-08-17 05:01:40',NULL,0),(110,30,NULL,'2024-08-14 05:02:57','2024-08-17 05:02:57',NULL,0),(111,30,NULL,'2024-08-14 05:12:38','2024-08-17 05:12:38',NULL,0),(112,70,NULL,'2024-08-14 14:13:10','2024-08-17 14:13:10',NULL,0),(113,30,NULL,'2024-08-14 05:14:34','2024-08-17 05:14:34',NULL,0),(114,30,NULL,'2024-08-14 05:19:23','2024-08-17 05:19:23',NULL,0),(115,30,NULL,'2024-08-14 05:20:36','2024-08-17 05:20:36',NULL,0),(116,30,NULL,'2024-08-14 05:21:22','2024-08-17 05:21:22',NULL,0),(117,30,NULL,'2024-08-14 05:21:54','2024-08-17 05:21:54',NULL,0),(118,30,NULL,'2024-08-14 05:22:33','2024-08-17 05:22:33',NULL,0),(119,30,NULL,'2024-08-14 05:27:22','2024-08-17 05:27:22','2024-08-14 05:37:20',1),(120,30,NULL,'2024-08-14 05:28:02','2024-08-17 05:28:02',NULL,0),(121,30,NULL,'2024-08-14 05:31:25','2024-08-17 05:31:25',NULL,0),(122,30,NULL,'2024-08-14 05:31:55','2024-08-17 05:31:55',NULL,0),(125,7,NULL,'2024-08-14 14:36:15','2024-08-17 14:36:15',NULL,0),(126,30,NULL,'2024-08-14 05:54:00','2024-08-17 05:54:00',NULL,0),(127,30,NULL,'2024-08-14 05:55:03','2024-08-17 05:55:03','2024-08-14 06:04:07',1),(128,30,NULL,'2024-08-14 05:56:44','2024-08-17 05:56:44','2024-08-14 06:11:15',1),(129,30,NULL,'2024-08-14 06:00:21','2024-08-17 06:00:21','2024-08-14 06:05:43',1),(130,30,NULL,'2024-08-14 06:01:18','2024-08-17 06:01:18',NULL,0),(131,30,NULL,'2024-08-14 06:01:52','2024-08-17 06:01:52','2024-08-14 06:03:47',1),(132,30,NULL,'2024-08-14 06:06:39','2024-08-17 06:06:39',NULL,0),(133,30,NULL,'2024-08-14 06:40:20','2024-08-17 06:40:20','2024-08-14 15:39:24',1),(134,30,NULL,'2024-08-14 07:29:52','2024-08-17 07:29:52','2024-08-14 15:38:48',1),(135,30,NULL,'2024-08-14 07:41:24','2024-08-17 07:41:24',NULL,0),(136,30,NULL,'2024-08-14 07:42:00','2024-08-17 07:42:00','2024-08-14 08:00:22',1),(137,30,NULL,'2024-08-14 07:42:31','2024-08-17 07:42:31',NULL,0),(138,30,NULL,'2024-08-14 07:51:29','2024-08-17 07:51:29','2024-08-14 08:24:43',1),(139,30,NULL,'2024-08-14 07:56:49','2024-08-17 07:56:49','2024-08-14 07:59:08',1),(140,30,NULL,'2024-08-14 08:17:12','2024-08-17 08:17:12','2024-08-14 08:20:03',1),(141,30,NULL,'2024-08-14 08:22:25','2024-08-17 08:22:25','2024-08-14 08:23:36',1),(142,26,NULL,'2024-08-14 08:27:58','2024-08-17 08:27:58','2024-08-14 08:29:46',1),(143,26,NULL,'2024-08-14 08:28:49','2024-08-17 08:28:49',NULL,0),(144,26,NULL,'2024-08-14 08:30:14','2024-08-17 08:30:14',NULL,0),(145,26,NULL,'2024-08-14 08:31:12','2024-08-17 08:31:12',NULL,0),(146,26,NULL,'2024-08-14 08:35:27','2024-08-17 08:35:27','2024-08-14 08:36:37',1),(147,30,NULL,'2024-08-14 15:35:50','2024-08-17 15:35:50',NULL,0),(148,30,NULL,'2024-08-14 16:26:32','2024-08-17 16:26:32','2024-08-14 16:28:50',1),(149,30,NULL,'2024-08-15 05:34:57','2024-08-18 05:34:57','2024-08-15 05:35:34',1),(150,30,NULL,'2024-08-15 06:01:27','2024-08-18 06:01:27',NULL,0),(151,70,NULL,'2024-08-15 06:48:48','2024-08-18 06:48:48',NULL,0),(152,70,NULL,'2024-08-15 06:50:21','2024-08-18 06:50:21',NULL,0),(153,70,NULL,'2024-08-15 06:52:04','2024-08-18 06:52:04',NULL,0),(154,70,NULL,'2024-08-15 06:53:54','2024-08-18 06:53:54',NULL,0),(155,70,NULL,'2024-08-15 06:54:08','2024-08-18 06:54:08',NULL,0),(156,70,NULL,'2024-08-15 06:55:10','2024-08-18 06:55:10',NULL,0),(157,70,NULL,'2024-08-15 06:55:15','2024-08-18 06:55:15',NULL,0),(158,70,NULL,'2024-08-15 06:56:20','2024-08-18 06:56:20',NULL,0),(159,70,NULL,'2024-08-15 06:57:21','2024-08-18 06:57:21',NULL,0),(160,70,NULL,'2024-08-15 06:57:30','2024-08-18 06:57:30',NULL,0),(161,70,NULL,'2024-08-15 06:59:28','2024-08-18 06:59:28',NULL,0),(166,70,NULL,'2024-08-15 07:00:58','2024-08-18 07:00:58',NULL,0),(167,70,NULL,'2024-08-15 07:04:24','2024-08-18 07:04:24',NULL,0),(169,70,NULL,'2024-08-15 07:04:55','2024-08-18 07:04:55',NULL,0),(170,70,NULL,'2024-08-15 07:05:37','2024-08-18 07:05:37',NULL,0),(171,70,NULL,'2024-08-15 07:07:59','2024-08-18 07:07:59',NULL,0),(172,70,NULL,'2024-08-15 07:08:19','2024-08-18 07:08:19',NULL,0),(174,70,NULL,'2024-08-15 07:08:55','2024-08-18 07:08:55',NULL,0),(176,70,NULL,'2024-08-15 07:10:39','2024-08-18 07:10:39',NULL,0),(177,70,NULL,'2024-08-15 07:12:39','2024-08-18 07:12:39',NULL,0),(178,70,NULL,'2024-08-15 07:12:46','2024-08-18 07:12:46',NULL,0),(179,70,NULL,'2024-08-15 07:12:57','2024-08-18 07:12:57',NULL,0),(181,70,NULL,'2024-08-15 07:14:36','2024-08-18 07:14:36',NULL,0),(182,70,NULL,'2024-08-15 07:14:44','2024-08-18 07:14:44',NULL,0),(183,70,NULL,'2024-08-15 07:17:55','2024-08-18 07:17:55',NULL,0),(184,70,NULL,'2024-08-15 07:18:39','2024-08-18 07:18:39',NULL,0),(185,70,NULL,'2024-08-15 07:22:51','2024-08-18 07:22:51',NULL,0),(186,70,NULL,'2024-08-15 07:22:59','2024-08-18 07:22:59',NULL,0),(187,70,NULL,'2024-08-15 07:25:38','2024-08-18 07:25:38',NULL,0),(188,70,NULL,'2024-08-15 07:25:55','2024-08-18 07:25:55',NULL,0),(189,70,NULL,'2024-08-15 07:26:40','2024-08-18 07:26:40',NULL,0),(191,70,NULL,'2024-08-15 07:29:04','2024-08-18 07:29:04',NULL,0),(192,70,NULL,'2024-08-15 07:30:52','2024-08-18 07:30:52',NULL,0),(193,70,NULL,'2024-08-15 07:33:57','2024-08-18 07:33:57',NULL,0),(196,70,NULL,'2024-08-15 07:37:36','2024-08-18 07:37:36',NULL,0),(200,70,NULL,'2024-08-15 07:40:17','2024-08-18 07:40:17',NULL,0),(201,70,NULL,'2024-08-15 07:40:31','2024-08-18 07:40:31',NULL,0),(202,70,NULL,'2024-08-15 07:43:14','2024-08-18 07:43:14',NULL,0),(203,70,NULL,'2024-08-15 07:45:21','2024-08-18 07:45:21',NULL,0),(204,70,NULL,'2024-08-15 07:45:27','2024-08-18 07:45:27',NULL,0),(205,70,NULL,'2024-08-15 07:46:22','2024-08-18 07:46:22',NULL,0),(206,70,NULL,'2024-08-15 07:46:33','2024-08-18 07:46:33',NULL,0),(207,70,NULL,'2024-08-15 07:47:39','2024-08-18 07:47:39',NULL,0),(208,70,NULL,'2024-08-15 07:48:06','2024-08-18 07:48:06',NULL,0),(209,70,NULL,'2024-08-15 07:48:34','2024-08-18 07:48:34',NULL,0),(210,70,NULL,'2024-08-15 07:48:39','2024-08-18 07:48:39',NULL,0),(211,70,NULL,'2024-08-15 07:48:53','2024-08-18 07:48:53',NULL,0),(212,70,NULL,'2024-08-15 07:49:03','2024-08-18 07:49:03',NULL,0),(213,70,NULL,'2024-08-15 07:49:22','2024-08-18 07:49:22',NULL,0),(214,70,NULL,'2024-08-15 07:50:02','2024-08-18 07:50:02',NULL,0),(215,70,NULL,'2024-08-15 07:50:07','2024-08-18 07:50:07',NULL,0),(216,70,NULL,'2024-08-15 07:50:27','2024-08-18 07:50:27',NULL,0),(217,70,NULL,'2024-08-15 07:50:43','2024-08-18 07:50:43',NULL,0),(218,70,NULL,'2024-08-15 07:53:17','2024-08-18 07:53:17',NULL,0),(220,70,NULL,'2024-08-15 07:54:23','2024-08-18 07:54:23',NULL,0),(221,70,NULL,'2024-08-15 07:54:50','2024-08-18 07:54:50',NULL,0),(222,70,NULL,'2024-08-15 07:57:25','2024-08-18 07:57:25',NULL,0),(225,70,NULL,'2024-08-15 07:58:27','2024-08-18 07:58:27',NULL,0),(226,70,NULL,'2024-08-15 08:00:18','2024-08-18 08:00:18',NULL,0),(227,70,NULL,'2024-08-15 08:03:01','2024-08-18 08:03:01',NULL,0),(228,70,NULL,'2024-08-15 08:03:08','2024-08-18 08:03:08',NULL,0),(229,70,NULL,'2024-08-15 08:07:59','2024-08-18 08:07:59',NULL,0),(230,70,NULL,'2024-08-15 08:08:22','2024-08-18 08:08:22',NULL,0),(231,70,NULL,'2024-08-15 08:09:45','2024-08-18 08:09:45',NULL,0),(232,70,NULL,'2024-08-15 08:11:00','2024-08-18 08:11:00',NULL,0),(233,70,NULL,'2024-08-15 08:11:51','2024-08-18 08:11:51',NULL,0),(234,70,NULL,'2024-08-15 08:12:10','2024-08-18 08:12:10',NULL,0),(235,70,NULL,'2024-08-15 08:14:24','2024-08-18 08:14:24',NULL,0),(236,70,NULL,'2024-08-15 08:16:09','2024-08-18 08:16:09',NULL,0),(237,70,NULL,'2024-08-15 08:19:11','2024-08-18 08:19:11',NULL,0),(238,70,NULL,'2024-08-15 08:19:24','2024-08-18 08:19:24',NULL,0),(239,70,NULL,'2024-08-15 08:20:22','2024-08-18 08:20:22',NULL,0),(240,70,NULL,'2024-08-15 08:21:01','2024-08-18 08:21:01',NULL,0),(241,70,NULL,'2024-08-15 08:21:23','2024-08-18 08:21:23',NULL,0),(244,26,NULL,'2024-08-15 08:22:47','2024-08-18 08:22:47',NULL,0),(245,26,NULL,'2024-08-15 08:25:05','2024-08-18 08:25:05',NULL,0),(246,26,NULL,'2024-08-15 08:25:47','2024-08-18 08:25:47',NULL,0),(247,26,NULL,'2024-08-15 08:25:52','2024-08-18 08:25:52',NULL,0),(248,26,NULL,'2024-08-15 08:26:01','2024-08-18 08:26:01',NULL,0),(249,26,NULL,'2024-08-15 08:29:25','2024-08-18 08:29:25',NULL,0);
/*!40000 ALTER TABLE `rent` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent_log`
--

DROP TABLE IF EXISTS `rent_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent_log` (
  `log_id` int NOT NULL AUTO_INCREMENT,
  `rent_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `product_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `log_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`log_id`),
  KEY `FK_RENT_TO_RENT_LOG_1` (`rent_id`),
  KEY `FK_LOCKER_TO_RENT_LOG_1` (`locker_id`),
  KEY `FK_PRODUCT_TO_RENT_LOG_1` (`product_id`),
  KEY `FK_PRODUCT_STATUS_TO_RENT_LOG_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RENT_LOG_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RENT_LOG_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RENT_LOG_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RENT_TO_RENT_LOG_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=451 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent_log`
--

LOCK TABLES `rent_log` WRITE;
/*!40000 ALTER TABLE `rent_log` DISABLE KEYS */;
INSERT INTO `rent_log` VALUES (93,1,1,1,1,2,'2024-07-23 13:27:00'),(94,1,2,2,1,1,'2024-07-23 13:27:00'),(95,1,1,1,8,2,'2024-07-24 06:58:00'),(96,1,2,2,8,1,'2024-07-24 06:58:00'),(97,2,3,3,1,3,'2024-07-23 16:11:00'),(98,2,7,7,1,2,'2024-07-23 16:11:00'),(99,3,8,8,1,1,'2024-07-23 17:22:00'),(100,3,9,9,1,2,'2024-07-23 17:22:00'),(101,3,8,8,8,1,'2024-07-23 19:15:00'),(102,3,9,9,8,2,'2024-07-23 19:15:00'),(103,4,14,14,1,4,'2024-07-23 16:19:00'),(104,4,15,15,1,1,'2024-07-23 16:19:00'),(105,5,1,1,1,5,'2024-06-01 08:00:00'),(106,5,2,2,1,3,'2024-06-01 08:00:00'),(107,5,1,1,8,4,'2024-06-03 17:30:00'),(108,5,1,1,6,1,'2024-06-03 17:30:00'),(109,5,2,2,8,2,'2024-06-03 17:30:00'),(110,5,2,2,7,1,'2024-06-03 17:30:00'),(111,6,3,3,1,2,'2024-06-05 10:30:00'),(112,6,7,7,1,1,'2024-06-05 10:30:00'),(113,6,3,3,8,2,'2024-06-08 09:45:00'),(114,6,7,7,8,1,'2024-06-08 09:45:00'),(115,7,8,8,1,3,'2024-06-10 13:00:00'),(116,7,9,9,1,2,'2024-06-10 13:00:00'),(117,7,8,8,8,3,'2024-06-13 11:30:00'),(118,7,9,9,8,2,'2024-06-13 11:30:00'),(119,8,14,14,1,4,'2024-06-15 15:30:00'),(120,8,14,14,8,3,'2024-06-16 09:15:00'),(121,8,14,14,6,1,'2024-06-16 09:15:00'),(122,9,15,15,1,2,'2024-06-20 09:00:00'),(123,9,13,13,1,1,'2024-06-20 09:00:00'),(124,9,15,15,8,2,'2024-06-23 08:45:00'),(125,9,13,13,8,1,'2024-06-23 08:45:00'),(126,10,159,17,1,3,'2024-06-25 11:30:00'),(127,10,160,18,1,2,'2024-06-25 11:30:00'),(128,10,159,17,8,3,'2024-06-28 10:15:00'),(129,10,160,18,8,2,'2024-06-28 10:15:00'),(130,11,161,19,1,5,'2024-07-01 14:00:00'),(131,11,162,20,1,2,'2024-07-01 14:00:00'),(132,11,161,19,8,4,'2024-07-03 16:45:00'),(133,11,161,19,7,1,'2024-07-03 16:45:00'),(134,11,162,20,8,2,'2024-07-03 16:45:00'),(135,12,1,1,1,3,'2024-07-05 16:30:00'),(136,12,2,2,1,2,'2024-07-05 16:30:00'),(137,12,1,1,8,3,'2024-07-08 15:00:00'),(138,12,2,2,8,2,'2024-07-08 15:00:00'),(140,14,9,9,1,2,'2024-07-30 13:52:40'),(141,15,9,9,1,2,'2024-07-30 13:55:44'),(142,16,9,9,1,2,'2024-07-30 13:56:25'),(143,18,9,9,1,2,'2024-07-30 13:59:11'),(144,19,9,9,1,2,'2024-07-30 13:59:50'),(145,20,9,9,1,2,'2024-07-30 14:05:48'),(146,21,9,9,1,2,'2024-07-30 14:17:48'),(147,22,9,9,1,2,'2024-07-30 14:18:27'),(148,23,9,9,1,2,'2024-07-30 14:19:25'),(149,24,9,9,1,1,'2024-07-30 14:20:21'),(150,25,9,9,1,1,'2024-07-30 14:23:00'),(151,27,9,9,1,1,'2024-07-30 14:25:32'),(152,28,9,9,1,1,'2024-07-30 14:27:08'),(153,29,9,9,1,1,'2024-07-30 14:27:35'),(154,30,9,9,1,1,'2024-07-30 14:28:16'),(155,31,9,9,1,1,'2024-07-30 14:29:09'),(156,32,9,9,1,1,'2024-07-30 14:29:34'),(157,33,9,9,1,1,'2024-07-30 14:31:31'),(158,34,9,9,1,1,'2024-07-30 14:32:22'),(159,35,9,9,1,1,'2024-07-30 14:32:53'),(160,36,9,9,1,1,'2024-07-30 14:35:01'),(161,37,9,9,1,1,'2024-07-30 14:38:26'),(162,38,9,9,1,1,'2024-07-30 14:39:02'),(163,39,9,9,1,1,'2024-07-30 14:39:34'),(164,40,9,9,1,1,'2024-07-30 14:44:27'),(165,41,9,9,1,1,'2024-07-30 14:45:09'),(166,14,9,9,8,1,'2024-07-30 17:46:30'),(167,14,9,9,8,1,'2024-07-30 17:47:53'),(169,15,9,9,8,1,'2024-07-30 17:56:45'),(170,15,9,9,8,1,'2024-07-30 17:56:51'),(171,42,9,9,1,1,'2024-07-31 12:44:06'),(172,43,8,8,1,1,'2024-08-01 12:55:34'),(173,43,13,13,1,1,'2024-08-01 12:55:34'),(174,44,8,8,1,1,'2024-08-02 10:03:40'),(175,44,13,13,1,1,'2024-08-02 10:03:40'),(176,44,8,8,8,1,'2024-08-02 10:04:42'),(177,44,13,13,8,1,'2024-08-02 10:04:42'),(178,43,8,8,8,1,'2024-08-02 10:07:41'),(179,43,13,13,8,1,'2024-08-02 10:07:41'),(180,45,8,8,1,1,'2024-08-02 10:09:27'),(181,45,13,13,1,1,'2024-08-02 10:09:28'),(182,45,8,8,8,1,'2024-08-02 10:09:33'),(183,45,13,13,8,1,'2024-08-02 10:09:33'),(184,46,8,8,1,1,'2024-08-02 13:12:17'),(185,46,13,13,1,1,'2024-08-02 13:12:17'),(186,46,8,8,8,1,'2024-08-02 13:14:49'),(187,46,13,13,8,1,'2024-08-02 13:14:49'),(188,47,8,8,1,1,'2024-08-02 13:17:24'),(189,47,13,13,1,1,'2024-08-02 13:17:24'),(190,47,8,8,8,1,'2024-08-02 13:19:36'),(191,47,13,13,8,1,'2024-08-02 13:19:36'),(192,48,8,8,1,1,'2024-08-02 16:55:19'),(193,48,13,13,1,1,'2024-08-02 16:55:19'),(194,27,9,9,8,1,'2024-08-04 09:01:21'),(195,25,9,9,8,1,'2024-08-04 09:01:36'),(196,16,9,9,8,1,'2024-08-04 09:31:16'),(197,28,9,9,8,1,'2024-08-04 09:31:36'),(198,29,9,9,8,1,'2024-08-04 09:31:38'),(199,30,9,9,8,1,'2024-08-04 09:31:55'),(200,31,9,9,8,1,'2024-08-04 09:31:58'),(201,32,9,9,8,1,'2024-08-04 09:32:00'),(202,33,9,9,8,1,'2024-08-04 09:32:54'),(203,34,9,9,8,1,'2024-08-04 09:32:57'),(204,35,9,9,8,1,'2024-08-04 09:32:59'),(205,49,8,8,1,1,'2024-08-04 09:39:50'),(206,49,15,76,1,10,'2024-08-04 09:39:50'),(207,50,9,9,1,1,'2024-08-04 10:16:37'),(208,51,9,9,1,1,'2024-08-08 15:03:02'),(209,51,13,13,1,1,'2024-08-08 15:03:02'),(210,50,9,9,8,1,'2024-08-08 06:43:10'),(216,2,3,3,8,2,'2024-08-09 01:30:41'),(217,2,7,7,8,2,'2024-08-09 01:30:41'),(219,2,3,3,8,1,'2024-08-09 01:32:13'),(220,52,2,2,1,1,'2024-08-09 04:46:15'),(221,52,3,3,1,1,'2024-08-09 04:46:15'),(222,53,7,7,1,1,'2024-08-09 05:09:30'),(223,53,13,13,1,1,'2024-08-09 05:09:30'),(224,54,3,3,1,1,'2024-08-09 05:11:17'),(225,54,7,7,1,1,'2024-08-09 05:11:17'),(226,56,8,8,1,1,'2024-08-09 05:27:48'),(227,56,9,9,1,1,'2024-08-09 05:27:48'),(228,57,160,18,1,1,'2024-08-09 05:28:23'),(229,57,161,19,1,1,'2024-08-09 05:28:23'),(230,58,1,1,1,2,'2024-08-09 05:52:26'),(231,59,1,1,1,1,'2024-08-09 14:58:46'),(232,60,1,1,1,1,'2024-08-09 15:01:37'),(233,61,3,3,1,1,'2024-08-09 06:38:01'),(234,62,13,13,1,1,'2024-08-09 06:39:58'),(235,62,14,14,1,1,'2024-08-09 06:39:58'),(236,63,1,1,1,1,'2024-08-09 06:46:59'),(237,20,9,9,8,2,'2024-08-09 07:32:11'),(238,64,1,1,1,1,'2024-08-09 08:31:52'),(239,65,1,1,1,100,'2024-08-10 14:55:05'),(240,68,1,1,1,2,'2024-08-11 03:21:06'),(241,68,9,9,1,1,'2024-08-11 03:21:06'),(242,69,14,14,1,1,'2024-08-11 07:27:14'),(243,70,2,2,1,2,'2024-08-11 07:28:16'),(244,71,1,1,1,2,'2024-08-11 07:45:12'),(245,21,9,9,8,2,'2024-08-11 07:45:59'),(246,72,9,9,1,1,'2024-08-11 07:56:57'),(247,22,9,9,8,2,'2024-08-11 08:48:08'),(248,40,9,9,8,1,'2024-08-11 08:49:41'),(249,73,14,14,1,1,'2024-08-11 09:04:29'),(250,73,13,13,1,1,'2024-08-11 09:04:29'),(251,74,7,7,1,1,'2024-08-12 00:07:08'),(252,75,1,1,1,1,'2024-08-12 02:02:02'),(253,76,2,2,1,1,'2024-08-12 02:03:09'),(254,77,1,1,1,2,'2024-08-12 02:20:17'),(255,23,9,9,8,2,'2024-08-12 13:28:42'),(256,36,9,9,8,1,'2024-08-12 13:29:15'),(257,24,9,9,8,1,'2024-08-12 15:25:33'),(258,48,8,8,8,1,'2024-08-12 15:25:54'),(259,48,13,13,8,1,'2024-08-12 15:25:54'),(260,51,9,9,8,1,'2024-08-12 15:26:12'),(261,51,13,13,8,1,'2024-08-12 15:26:12'),(262,78,15,76,1,1,'2024-08-12 07:53:05'),(263,79,15,76,1,1,'2024-08-12 08:43:40'),(264,80,15,76,1,1,'2024-08-12 12:13:12'),(265,81,15,76,1,1,'2024-08-12 12:14:09'),(266,82,15,76,1,2,'2024-08-13 01:34:00'),(267,82,3,3,1,4,'2024-08-13 01:34:00'),(268,82,3,3,4,1,'2024-08-13 14:30:22'),(269,82,3,3,4,1,'2024-08-13 14:31:40'),(270,82,15,76,8,2,'2024-08-13 15:03:42'),(271,81,15,76,8,1,'2024-08-13 15:52:56'),(272,80,15,76,8,1,'2024-08-13 15:58:29'),(273,79,15,76,8,1,'2024-08-13 16:02:08'),(274,83,15,76,1,1,'2024-08-13 16:12:56'),(275,83,15,76,8,1,'2024-08-13 16:13:48'),(276,84,7,7,1,2,'2024-08-13 08:40:13'),(277,85,7,7,1,1,'2024-08-13 10:27:15'),(278,86,3,3,1,1,'2024-08-13 12:07:02'),(279,87,15,76,1,1,'2024-08-13 12:19:58'),(280,87,15,76,4,1,'2024-08-13 15:14:05'),(281,82,3,3,4,2,'2024-08-13 15:14:05'),(282,86,3,3,4,1,'2024-08-14 00:24:01'),(283,78,15,76,4,1,'2024-08-14 00:24:01'),(284,76,2,2,4,1,'2024-08-14 00:32:05'),(285,75,1,1,4,1,'2024-08-14 00:32:05'),(286,85,7,7,4,1,'2024-08-14 01:17:20'),(287,49,8,8,7,1,'2024-08-14 01:17:20'),(289,98,15,76,1,1,'2024-08-14 10:39:06'),(290,49,15,76,8,1,'2024-08-14 01:39:11'),(291,99,15,76,1,10,'2024-08-14 10:39:46'),(292,99,15,76,8,10,'2024-08-14 10:42:19'),(293,49,15,76,8,1,'2024-08-14 01:57:28'),(294,73,14,14,6,1,'2024-08-14 03:49:26'),(295,77,1,1,6,2,'2024-08-14 03:49:26'),(296,73,14,14,6,1,'2024-08-14 03:50:03'),(297,103,7,7,1,1,'2024-08-14 04:14:53'),(298,104,1,1,1,1,'2024-08-14 04:15:05'),(299,49,15,76,8,1,'2024-08-14 04:18:56'),(300,49,15,76,8,1,'2024-08-14 04:20:46'),(301,105,15,76,1,1,'2024-08-14 04:27:28'),(302,106,15,76,1,1,'2024-08-14 04:29:59'),(303,106,15,76,6,1,'2024-08-14 04:32:20'),(304,107,15,76,1,1,'2024-08-14 04:40:01'),(305,108,15,76,1,1,'2024-08-14 04:59:55'),(306,109,15,76,1,1,'2024-08-14 05:01:40'),(307,110,15,76,1,1,'2024-08-14 05:02:57'),(308,111,15,76,1,1,'2024-08-14 05:12:38'),(309,112,13,13,1,1,'2024-08-14 14:13:10'),(310,113,15,76,1,1,'2024-08-14 05:14:34'),(311,114,15,76,1,1,'2024-08-14 05:19:23'),(312,115,15,76,1,1,'2024-08-14 05:20:36'),(313,116,15,76,1,1,'2024-08-14 05:21:22'),(314,117,15,76,1,1,'2024-08-14 05:21:54'),(315,118,15,76,1,1,'2024-08-14 05:22:33'),(316,119,15,76,1,1,'2024-08-14 05:27:22'),(317,120,15,76,1,1,'2024-08-14 05:28:03'),(318,121,2,2,1,1,'2024-08-14 05:31:25'),(319,122,1,1,1,1,'2024-08-14 05:31:55'),(324,125,13,13,1,1,'2024-08-14 14:36:15'),(325,119,15,76,8,1,'2024-08-14 05:37:20'),(326,126,15,76,1,1,'2024-08-14 05:54:00'),(327,127,15,76,1,1,'2024-08-14 05:55:03'),(328,128,15,76,1,1,'2024-08-14 05:56:44'),(329,129,15,76,1,1,'2024-08-14 06:00:21'),(330,130,3,3,1,2,'2024-08-14 06:01:18'),(331,130,15,76,1,1,'2024-08-14 06:01:18'),(332,131,15,76,1,1,'2024-08-14 06:01:52'),(333,130,3,3,8,1,'2024-08-14 06:03:20'),(334,130,15,76,8,1,'2024-08-14 06:03:20'),(335,131,15,76,8,1,'2024-08-14 06:03:47'),(336,127,15,76,6,1,'2024-08-14 06:04:07'),(337,129,15,76,8,1,'2024-08-14 06:05:43'),(338,132,3,3,1,1,'2024-08-14 06:06:39'),(339,128,15,76,8,1,'2024-08-14 06:11:15'),(340,133,7,7,1,1,'2024-08-14 06:40:20'),(341,134,15,76,1,1,'2024-08-14 07:29:52'),(342,135,15,76,1,1,'2024-08-14 07:41:24'),(343,136,15,76,1,1,'2024-08-14 07:42:00'),(344,137,15,76,1,1,'2024-08-14 07:42:31'),(345,138,15,76,1,1,'2024-08-14 07:51:29'),(346,139,15,76,1,1,'2024-08-14 07:56:49'),(347,139,15,76,8,1,'2024-08-14 07:59:08'),(348,136,15,76,8,1,'2024-08-14 08:00:22'),(349,140,15,76,1,1,'2024-08-14 08:17:12'),(350,140,15,76,8,1,'2024-08-14 08:20:03'),(351,141,15,76,1,1,'2024-08-14 08:22:26'),(352,141,15,76,8,1,'2024-08-14 08:23:36'),(353,138,15,76,8,1,'2024-08-14 08:24:43'),(354,142,3,3,1,1,'2024-08-14 08:27:58'),(355,143,3,3,1,1,'2024-08-14 08:28:49'),(356,142,3,3,8,1,'2024-08-14 08:29:46'),(357,144,3,3,1,1,'2024-08-14 08:30:14'),(358,145,1,1,1,1,'2024-08-14 08:31:12'),(359,146,15,76,1,1,'2024-08-14 08:35:27'),(360,146,15,76,8,1,'2024-08-14 08:36:37'),(361,147,15,76,1,1,'2024-08-14 15:35:50'),(362,134,15,76,6,1,'2024-08-14 15:38:48'),(363,133,7,7,6,1,'2024-08-14 15:39:24'),(364,148,7,7,1,1,'2024-08-14 16:26:32'),(365,148,7,7,6,1,'2024-08-14 16:28:50'),(366,149,7,7,1,1,'2024-08-15 05:34:57'),(367,149,7,7,6,1,'2024-08-15 05:35:34'),(368,150,7,7,1,1,'2024-08-15 06:01:27'),(369,151,15,76,1,2,'2024-08-15 06:48:48'),(370,152,1,1,1,1,'2024-08-15 06:50:21'),(371,153,1,1,1,1,'2024-08-15 06:52:04'),(372,154,1,1,1,1,'2024-08-15 06:53:54'),(373,155,7,7,1,1,'2024-08-15 06:54:08'),(374,156,1,1,1,1,'2024-08-15 06:55:10'),(375,157,1,1,1,1,'2024-08-15 06:55:15'),(376,158,1,1,1,1,'2024-08-15 06:56:20'),(377,159,2,2,1,1,'2024-08-15 06:57:21'),(378,160,13,13,1,6,'2024-08-15 06:57:30'),(379,161,2,2,1,1,'2024-08-15 06:59:28'),(380,166,2,2,1,1,'2024-08-15 07:00:58'),(381,167,15,76,1,1,'2024-08-15 07:04:24'),(382,169,15,76,1,2,'2024-08-15 07:04:55'),(383,170,2,2,1,1,'2024-08-15 07:05:37'),(384,171,2,2,1,1,'2024-08-15 07:07:59'),(385,172,15,76,1,1,'2024-08-15 07:08:19'),(386,174,15,76,1,1,'2024-08-15 07:08:55'),(387,176,15,76,1,2,'2024-08-15 07:10:39'),(388,177,15,76,1,1,'2024-08-15 07:12:39'),(389,178,15,76,1,2,'2024-08-15 07:12:46'),(390,179,14,14,1,1,'2024-08-15 07:12:57'),(391,181,15,76,1,2,'2024-08-15 07:14:36'),(392,182,13,13,1,1,'2024-08-15 07:14:44'),(393,183,14,14,1,1,'2024-08-15 07:17:55'),(394,184,8,8,1,1,'2024-08-15 07:18:39'),(395,185,2,2,1,1,'2024-08-15 07:22:51'),(396,186,8,8,1,1,'2024-08-15 07:22:59'),(397,187,2,2,1,1,'2024-08-15 07:25:39'),(398,188,8,8,1,1,'2024-08-15 07:25:55'),(399,189,9,9,1,1,'2024-08-15 07:26:40'),(400,191,15,76,1,2,'2024-08-15 07:29:04'),(401,192,15,76,1,1,'2024-08-15 07:30:52'),(402,193,15,76,1,1,'2024-08-15 07:33:57'),(403,196,13,13,1,1,'2024-08-15 07:37:36'),(404,200,1,1,1,1,'2024-08-15 07:40:17'),(405,201,1,1,1,1,'2024-08-15 07:40:31'),(406,202,1,1,1,1,'2024-08-15 07:43:14'),(407,203,1,1,1,1,'2024-08-15 07:45:21'),(408,204,1,1,1,1,'2024-08-15 07:45:27'),(409,205,7,7,1,1,'2024-08-15 07:46:22'),(410,206,7,7,1,1,'2024-08-15 07:46:33'),(411,207,7,7,1,1,'2024-08-15 07:47:39'),(412,208,7,7,1,1,'2024-08-15 07:48:06'),(413,209,7,7,1,1,'2024-08-15 07:48:34'),(414,210,7,7,1,1,'2024-08-15 07:48:39'),(415,211,7,7,1,1,'2024-08-15 07:48:53'),(416,212,1,1,1,1,'2024-08-15 07:49:03'),(417,213,1,1,1,1,'2024-08-15 07:49:22'),(418,214,1,1,1,1,'2024-08-15 07:50:02'),(419,215,1,1,1,1,'2024-08-15 07:50:07'),(420,216,1,1,1,1,'2024-08-15 07:50:27'),(421,217,7,7,1,1,'2024-08-15 07:50:43'),(422,218,7,7,1,1,'2024-08-15 07:53:17'),(423,220,7,7,1,1,'2024-08-15 07:54:23'),(424,221,14,14,1,1,'2024-08-15 07:54:50'),(425,222,14,14,1,1,'2024-08-15 07:57:25'),(426,225,14,14,1,1,'2024-08-15 07:58:27'),(427,226,14,14,1,1,'2024-08-15 08:00:18'),(428,227,8,8,1,1,'2024-08-15 08:03:01'),(429,228,8,8,1,1,'2024-08-15 08:03:08'),(430,229,8,8,1,1,'2024-08-15 08:07:59'),(431,230,8,8,1,1,'2024-08-15 08:08:22'),(432,230,13,13,1,1,'2024-08-15 08:08:22'),(433,231,8,8,1,1,'2024-08-15 08:09:45'),(434,232,8,8,1,1,'2024-08-15 08:11:00'),(435,233,8,8,1,1,'2024-08-15 08:11:51'),(436,234,8,8,1,1,'2024-08-15 08:12:10'),(437,235,8,8,1,1,'2024-08-15 08:14:24'),(438,236,14,14,1,1,'2024-08-15 08:16:09'),(439,237,13,13,1,1,'2024-08-15 08:19:11'),(440,238,13,13,1,6,'2024-08-15 08:19:24'),(441,239,13,13,1,6,'2024-08-15 08:20:22'),(442,240,14,14,1,1,'2024-08-15 08:21:01'),(443,241,8,8,1,1,'2024-08-15 08:21:23'),(444,241,14,14,1,1,'2024-08-15 08:21:23'),(445,244,14,14,1,1,'2024-08-15 08:22:47'),(446,245,14,14,1,1,'2024-08-15 08:25:05'),(447,246,3,3,1,1,'2024-08-15 08:25:47'),(448,247,3,3,1,1,'2024-08-15 08:25:52'),(449,248,3,3,1,1,'2024-08-15 08:26:01'),(450,249,3,3,1,1,'2024-08-15 08:29:25');
/*!40000 ALTER TABLE `rent_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve`
--

DROP TABLE IF EXISTS `reserve`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve` (
  `reserve_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `is_ended` tinyint(1) NOT NULL DEFAULT '0',
  `end_dt` datetime DEFAULT NULL,
  `is_canceled` tinyint(1) NOT NULL DEFAULT '0',
  `is_taken` tinyint(1) NOT NULL DEFAULT '0',
  `rent_id` int DEFAULT NULL,
  `body_id` int NOT NULL,
  PRIMARY KEY (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_1` (`user_id`),
  KEY `FK_RENT_TO_RESERVE_1` (`rent_id`),
  KEY `FK_LOCKERBODY_TO_RESERVE_1_idx` (`body_id`),
  CONSTRAINT `FK_LOCKERBODY_TO_RESERVE_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `FK_RENT_TO_RESERVE_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=78 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve`
--

LOCK TABLES `reserve` WRITE;
/*!40000 ALTER TABLE `reserve` DISABLE KEYS */;
INSERT INTO `reserve` VALUES (1,10,'2024-07-22 08:00:00','2024-07-22 17:30:00',1,'2024-07-22 17:15:00',0,0,NULL,1),(2,6,'2024-07-22 09:30:00','2024-07-22 15:00:00',1,'2024-07-22 14:45:00',0,0,NULL,1),(3,7,'2024-07-22 11:00:00','2024-07-23 11:00:00',1,'2024-07-23 10:30:00',0,0,NULL,1),(4,8,'2024-07-22 14:30:00','2024-07-23 14:30:00',1,'2024-07-23 14:15:00',0,0,NULL,1),(5,9,'2024-07-23 08:45:00','2024-07-23 17:00:00',1,'2024-07-23 08:51:00',1,0,NULL,1),(6,10,'2024-07-23 10:15:00','2024-07-23 15:30:00',1,'2024-07-23 16:22:00',1,0,NULL,1),(7,6,'2024-07-23 13:00:00','2024-07-24 13:00:00',1,'2024-07-23 15:39:00',1,0,NULL,1),(8,7,'2024-07-23 15:30:00','2024-07-24 10:00:00',1,'2024-07-23 18:45:00',1,0,NULL,1),(9,8,'2024-07-23 09:00:00','2024-07-23 16:30:00',1,'2024-07-23 13:27:00',0,1,NULL,1),(10,9,'2024-07-23 11:30:00','2024-07-23 17:00:00',1,'2024-07-23 16:11:00',0,1,NULL,1),(11,10,'2024-07-23 14:00:00','2024-07-24 14:00:00',1,'2024-07-23 17:22:00',0,1,NULL,1),(12,6,'2024-07-23 16:15:00','2024-07-24 12:30:00',1,'2024-07-23 16:19:00',0,1,NULL,1),(13,7,'2024-07-23 08:30:00','2024-07-24 17:30:00',1,'2024-08-01 16:45:00',0,0,NULL,1),(14,8,'2024-07-23 10:00:00','2024-07-24 15:00:00',1,'2024-08-01 16:45:00',0,0,NULL,1),(15,9,'2024-07-23 13:45:00','2024-07-25 13:45:00',1,'2024-08-01 16:45:00',0,0,NULL,1),(16,10,'2024-07-23 15:15:00','2024-07-25 11:00:00',1,'2024-08-01 16:45:00',0,0,NULL,1),(17,4,'2024-08-01 13:26:07','2024-07-19 15:30:00',1,'2024-08-01 15:28:24',1,0,NULL,1),(18,4,'2024-08-01 13:27:12','2024-07-19 15:30:00',1,'2024-08-01 15:28:24',1,0,NULL,1),(19,4,'2024-08-01 13:29:15','2024-07-19 15:30:00',1,'2024-08-01 15:28:24',1,0,NULL,1),(20,4,'2024-08-01 15:28:09','2024-07-19 15:30:00',1,'2024-08-01 15:28:24',1,0,NULL,1),(21,4,'2024-08-01 17:12:59','2024-08-01 17:10:00',1,'2024-08-01 17:15:00',0,0,NULL,1),(22,4,'2024-08-01 17:14:18','2024-08-01 17:10:00',1,'2024-08-01 17:15:00',0,0,NULL,1),(23,4,'2024-08-02 10:15:58','2024-08-01 17:10:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(24,4,'2024-08-02 14:02:07','2024-08-01 17:10:00',1,'2024-08-02 14:03:00',0,0,NULL,1),(25,4,'2024-08-02 14:10:53','2024-08-01 17:10:00',1,'2024-08-02 14:11:07',0,0,NULL,1),(26,4,'2024-08-02 14:13:11','2024-08-01 17:10:00',1,'2024-08-02 14:13:41',0,0,NULL,1),(27,4,'2024-08-02 14:15:34','2024-08-01 17:10:00',1,'2024-08-05 21:30:54',0,0,NULL,1),(28,4,'2024-08-05 06:10:30','2024-08-01 17:10:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(29,4,'2024-08-05 06:11:07','2024-08-01 17:10:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(30,4,'2024-08-05 15:11:50','2024-08-05 15:14:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(31,4,'2024-08-05 16:10:23','2024-08-05 17:50:00',1,'2024-08-05 21:34:11',0,0,NULL,1),(32,4,'2024-08-05 17:27:51','2024-08-05 17:52:00',1,'2024-08-05 21:34:11',0,0,NULL,1),(33,4,'2024-08-05 20:28:52','2024-08-05 21:30:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(34,4,'2024-08-05 20:30:34','2024-08-05 21:50:00',1,'2024-08-05 21:34:11',0,0,NULL,1),(35,4,'2024-08-05 21:32:58','2024-08-05 22:34:00',1,'2024-08-05 21:34:11',0,0,NULL,1),(36,4,'2024-08-05 21:33:07','2024-08-05 22:37:00',1,'2024-08-05 21:34:56',0,0,NULL,1),(37,4,'2024-08-06 13:38:35','2024-08-06 01:41:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(38,4,'2024-08-06 13:38:57','2024-08-07 13:40:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(39,4,'2024-08-06 17:25:25','2024-08-06 17:30:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(40,4,'2024-08-06 17:26:43','2024-08-06 17:34:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(41,4,'2024-08-07 08:17:19','2024-08-07 17:17:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(42,4,'2024-08-07 08:17:39','2024-08-07 17:17:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(43,4,'2024-08-07 08:17:59','2024-08-07 17:17:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(44,4,'2024-08-07 08:18:16','2024-08-07 17:19:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(45,4,'2024-08-07 10:32:58','2024-08-16 19:32:00',0,NULL,0,0,NULL,1),(46,4,'2024-08-07 22:47:49','2024-08-01 17:10:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(47,3,'2024-08-07 23:07:42','2024-08-01 17:10:00',1,'2024-08-08 11:30:00',0,0,NULL,1),(48,70,'2024-08-09 04:53:34','2024-08-10 13:53:00',1,'2024-08-10 15:00:00',0,0,NULL,1),(49,6,'2024-08-09 05:51:35','2024-08-01 17:10:00',1,'2024-08-09 14:52:21',1,0,NULL,1),(50,6,'2024-08-09 14:51:42','2024-08-01 17:10:00',1,'2024-08-09 14:52:27',1,0,NULL,1),(51,6,'2024-08-09 14:52:01','2024-08-10 17:00:00',1,'2024-08-09 14:58:45',0,1,NULL,1),(52,6,'2024-08-09 15:01:30','2024-08-10 17:00:00',1,'2024-08-09 15:01:36',0,1,60,1),(53,70,'2024-08-09 07:16:11','2024-08-09 16:20:00',1,'2024-08-09 16:30:00',0,0,NULL,1),(54,6,'2024-08-10 14:59:15','2024-08-10 17:00:00',1,'2024-08-10 17:00:00',0,0,NULL,1),(55,70,'2024-08-12 00:42:45','2024-08-12 09:45:00',1,'2024-08-12 11:00:00',0,0,NULL,1),(56,70,'2024-08-12 07:01:53','2024-08-12 17:01:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(57,29,'2024-08-12 07:35:34','2024-08-12 16:38:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(58,29,'2024-08-12 07:48:16','2024-08-12 16:30:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(59,29,'2024-08-12 07:48:36','2024-08-12 17:00:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(60,29,'2024-08-12 07:48:54','2024-08-12 17:00:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(61,29,'2024-08-12 07:48:54','2024-08-12 17:00:00',1,'2024-08-12 17:30:00',0,0,NULL,1),(62,70,'2024-08-12 08:19:34','2024-08-12 18:30:00',1,'2024-08-12 19:00:00',0,0,NULL,1),(67,70,'2024-08-14 04:02:35','2024-08-15 11:00:00',0,NULL,0,0,NULL,1),(68,70,'2024-08-14 04:03:05','2024-08-15 11:00:00',0,NULL,0,0,NULL,1),(69,70,'2024-08-14 05:05:22','2024-08-15 11:00:00',0,NULL,0,0,NULL,1),(70,70,'2024-08-14 05:25:59','2024-08-15 13:00:00',0,NULL,0,0,NULL,1),(72,26,'2024-08-14 05:30:59','2024-08-17 13:30:00',0,NULL,0,0,NULL,1),(73,70,'2024-08-14 05:50:51','2024-08-16 11:00:00',0,NULL,0,0,NULL,1),(74,26,'2024-08-14 08:27:16','2024-08-15 14:00:00',0,NULL,0,0,NULL,1),(76,70,'2024-08-15 06:47:16','2024-08-22 13:00:00',0,NULL,0,0,NULL,1),(77,70,'2024-08-15 06:47:30','2024-08-22 13:00:00',0,NULL,0,0,NULL,1);
/*!40000 ALTER TABLE `reserve` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve_det`
--

DROP TABLE IF EXISTS `reserve_det`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve_det` (
  `det_id` int NOT NULL AUTO_INCREMENT,
  `reserve_id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `det_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`det_id`),
  KEY `FK_RESERVE_TO_RESERVE_DET_1` (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_DET_1` (`user_id`),
  KEY `FK_PRODUCT_TO_RESERVE_DET_1` (`product_id`),
  KEY `FK_LOCKER_TO_RESERVE_DET_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RESERVE_DET_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RESERVE_DET_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RESERVE_TO_RESERVE_DET_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_DET_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=122 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve_det`
--

LOCK TABLES `reserve_det` WRITE;
/*!40000 ALTER TABLE `reserve_det` DISABLE KEYS */;
INSERT INTO `reserve_det` VALUES (28,1,6,1,1,2,1,'2024-07-23 05:06:14'),(29,1,6,2,2,2,2,'2024-07-23 05:06:14'),(30,2,7,3,3,2,1,'2024-07-23 05:06:14'),(31,3,8,7,7,2,1,'2024-07-23 05:06:14'),(32,3,8,8,8,2,1,'2024-07-23 05:06:14'),(33,4,9,9,9,2,3,'2024-07-23 05:06:14'),(34,5,10,13,13,2,1,'2024-07-23 05:06:14'),(35,6,6,14,14,2,2,'2024-07-23 05:06:14'),(36,6,6,15,15,2,1,'2024-07-23 05:06:14'),(37,7,7,1,1,2,1,'2024-07-23 05:06:14'),(38,8,8,2,2,2,1,'2024-07-23 05:06:14'),(39,9,9,3,3,2,1,'2024-07-23 05:06:14'),(40,10,10,7,7,2,2,'2024-07-23 05:06:14'),(41,11,6,8,8,2,1,'2024-07-23 05:06:14'),(42,11,6,9,9,2,1,'2024-07-23 05:06:14'),(43,12,7,13,13,2,1,'2024-07-23 05:06:14'),(44,13,8,14,14,2,1,'2024-07-23 05:06:14'),(45,13,8,15,15,2,2,'2024-07-23 05:06:14'),(46,14,9,1,1,2,1,'2024-07-23 05:06:14'),(47,15,10,2,2,2,3,'2024-07-23 05:06:14'),(48,16,6,3,3,2,1,'2024-07-23 05:06:14'),(49,16,6,7,7,2,1,'2024-07-23 05:06:14'),(50,9,7,8,8,2,1,'2024-07-23 05:06:14'),(51,10,8,9,9,2,2,'2024-07-23 05:06:14'),(52,10,9,13,13,2,1,'2024-07-23 05:06:14'),(53,15,9,14,14,2,1,'2024-07-23 05:06:14'),(54,16,10,15,15,2,1,'2024-07-23 05:06:14'),(55,19,4,2,2,2,1,'2024-08-01 13:29:15'),(56,19,4,9,9,2,1,'2024-08-01 13:29:15'),(57,20,4,2,2,2,1,'2024-08-01 15:28:10'),(58,20,4,9,9,2,1,'2024-08-01 15:28:10'),(59,21,4,2,2,2,1,'2024-08-01 17:13:00'),(60,21,4,9,9,2,1,'2024-08-01 17:13:00'),(61,22,4,2,2,2,1,'2024-08-01 17:14:18'),(62,22,4,9,9,2,1,'2024-08-01 17:14:18'),(63,23,4,2,2,2,1,'2024-08-02 10:15:58'),(64,23,4,9,9,2,1,'2024-08-02 10:15:58'),(65,24,4,1,1,2,1,'2024-08-02 14:02:07'),(66,24,4,3,3,2,1,'2024-08-02 14:02:07'),(67,25,4,1,1,2,1,'2024-08-02 14:10:53'),(68,25,4,2,2,2,1,'2024-08-02 14:10:53'),(69,26,4,1,1,2,1,'2024-08-02 14:13:12'),(70,26,4,2,2,2,1,'2024-08-02 14:13:12'),(71,27,4,1,1,2,1,'2024-08-02 14:15:34'),(72,27,4,2,2,2,1,'2024-08-02 14:15:34'),(73,28,4,1,1,2,1,'2024-08-05 06:10:30'),(74,28,4,2,2,2,1,'2024-08-05 06:10:30'),(75,29,4,1,1,2,1,'2024-08-05 06:11:07'),(76,29,4,2,2,2,1,'2024-08-05 06:11:07'),(77,30,4,13,13,2,1,'2024-08-05 15:11:50'),(78,31,4,3,3,2,1,'2024-08-05 16:10:24'),(79,32,4,3,3,2,2,'2024-08-05 17:27:52'),(80,32,4,1,1,2,1,'2024-08-05 17:27:52'),(81,33,4,14,14,2,1,'2024-08-05 20:28:52'),(82,33,4,9,9,2,2,'2024-08-05 20:28:52'),(83,34,4,1,1,2,1,'2024-08-05 20:30:34'),(84,35,4,3,3,2,2,'2024-08-05 21:32:58'),(85,35,4,9,9,2,1,'2024-08-05 21:32:58'),(86,36,4,8,8,2,1,'2024-08-05 21:33:07'),(87,37,4,1,1,2,1,'2024-08-06 13:38:35'),(88,37,4,7,7,2,1,'2024-08-06 13:38:35'),(89,38,4,1,1,2,1,'2024-08-06 13:38:57'),(90,39,4,14,14,2,1,'2024-08-06 17:25:25'),(91,40,4,8,8,2,1,'2024-08-06 17:26:43'),(92,41,4,1,1,2,1,'2024-08-07 08:17:19'),(93,42,4,1,1,2,1,'2024-08-07 08:17:40'),(94,43,4,9,9,2,1,'2024-08-07 08:17:59'),(95,44,4,1,1,2,1,'2024-08-07 08:18:16'),(96,45,4,1,1,2,2,'2024-08-07 10:32:58'),(97,46,4,1,1,2,1,'2024-08-07 22:47:49'),(98,46,4,2,2,2,1,'2024-08-07 22:47:49'),(99,47,3,1,1,2,1,'2024-08-07 23:07:42'),(100,47,3,2,2,2,1,'2024-08-07 23:07:42'),(101,48,70,9,9,2,1,'2024-08-09 04:53:34'),(102,49,6,1,1,2,1,'2024-08-09 05:51:35'),(103,50,6,1,1,2,1,'2024-08-09 14:51:43'),(104,51,6,1,1,2,1,'2024-08-09 14:52:01'),(105,52,6,1,1,2,1,'2024-08-09 15:01:30'),(106,53,70,2,2,2,1,'2024-08-09 07:16:11'),(107,55,70,13,13,2,1,'2024-08-12 00:42:45'),(108,56,70,76,15,2,1,'2024-08-12 07:01:53'),(109,57,29,7,7,2,1,'2024-08-12 07:35:34'),(110,58,29,1,1,2,1,'2024-08-12 07:48:16'),(111,59,29,9,9,2,1,'2024-08-12 07:48:36'),(112,60,29,7,7,2,2,'2024-08-12 07:48:54'),(113,61,29,7,7,2,2,'2024-08-12 07:48:54'),(114,62,70,9,9,2,1,'2024-08-12 08:19:34'),(115,69,70,1,1,2,1,'2024-08-14 05:05:22'),(116,70,70,13,13,2,6,'2024-08-14 05:25:59'),(117,72,26,1,1,2,1,'2024-08-14 05:30:59'),(118,73,70,7,7,2,1,'2024-08-14 05:50:51'),(119,74,26,3,3,2,1,'2024-08-14 08:27:16'),(120,76,70,76,15,2,2,'2024-08-15 06:47:16'),(121,77,70,8,8,2,1,'2024-08-15 06:47:30');
/*!40000 ALTER TABLE `reserve_det` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `user_lgid` varchar(255) DEFAULT NULL,
  `user_pw` varchar(255) DEFAULT NULL,
  `user_nm` varchar(255) DEFAULT NULL,
  `emp_cd` varchar(20) NOT NULL,
  `user_img` varchar(255) DEFAULT NULL,
  `is_admin` tinyint(1) NOT NULL DEFAULT '0',
  `user_tel` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1' COMMENT '탈퇴 여부',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'admin1@company.com','{bcrypt}$2a$10$4HZzISiRpp0jD3UVBHiGYertOKN3e9vZQD9SCKSUEJGWVCUtai/0q',NULL,'EMP001',NULL,1,'010-0000-0010',1),(2,'admin2@company.com','5671','이영희','EMP002',NULL,1,'010-1234-5672',1),(3,'admin3@company.com','5672','박민수','EMP003',NULL,1,'010-1234-5673',1),(4,'admin4@company.com','5673','최지은','EMP004',NULL,1,'010-1234-5674',1),(5,'admin5@company.com','5674','정우성','EMP005',NULL,1,'010-1234-5675',1),(6,'user1@company.com','5675','장철민','EMP006',NULL,0,'010-1234-5676',1),(7,'user2@company.com','5676','한지민','EMP007',NULL,0,'010-1234-5677',1),(8,'user3@company.com','5677','김지훈','EMP008',NULL,0,'010-1234-5678',1),(9,'user4@company.com','5678','윤아름','EMP009',NULL,0,'010-1234-5679',1),(10,'user5@company.com','5679','오성민','EMP010',NULL,0,'010-1234-5680',1),(11,'user6@company.com','5680','서지호','EMP011',NULL,0,'010-1234-5681',1),(12,'user7@company.com','5681','배유진','EMP012',NULL,0,'010-1234-5682',1),(13,'user8@company.com','5682','문찬영','EMP013',NULL,0,'010-1234-5683',1),(14,'user9@company.com','5683','강혜진','EMP014',NULL,0,'010-1234-5684',1),(15,'user10@company.com','5684','윤성호','EMP015',NULL,0,'010-1234-5685',1),(16,'user11@company.com','5685','오지연','EMP016',NULL,0,'010-1234-5686',1),(17,'user12@company.com','5686','정준영','EMP017',NULL,0,'010-1234-5687',1),(18,'user13@company.com','5687','이정민','EMP018',NULL,0,'010-1234-5688',1),(19,'user14@company.com','5688','홍서연','EMP019',NULL,0,'010-1234-5689',1),(20,'user15@company.com','5689','류지호','EMP020',NULL,0,'010-1234-5690',1),(21,'user@naver.com','사용자 비밀번호','사용자명','사용자 사원 번호','사용자 사진 경로',0,'010-0000-0000',1),(22,'user2@naver.com','{bcrypt}$2a$10$su8XVQnsNXhAXD4szE9k6uzP9sxLMit1eV/Vqelj3QrvdaiHQ6k0G','사용자명','사용자 사원 번호','사용자 사진 경로',0,'010-0000-0000',1),(23,'user3@naver.com',NULL,NULL,'사용자 사원 번호','사용자 사진 경로',0,NULL,1),(24,'ssafy@naver.com',NULL,NULL,'','.',0,NULL,1),(25,'ssafy1@naver.com','{bcrypt}$2a$10$ds8WXxNryyvPOQaM..mJWuiC9/SOlnSiqf1DP2xx3JSF23ZzRdEGa','박','','.',0,'010-1234-5678',1),(26,'user4@naver.com','{bcrypt}$2a$10$fs2QDRMH/f/Xo18BFeB7i.NA1ePkNzM739nhom2MOw1y6NdHh3Km.','김태연','TY123','사용자 사진 경로',0,'010-4582-6505',1),(27,'admin@company.com','{bcrypt}$2a$10$mQuZ7e0Pwe2v3sC99I3HkuP2QfuDoWE8eD1uuvYkz8UUrGyum3mqC','admin1','','ddd',0,'',1),(29,'ssafy3@naver.com','{bcrypt}$2a$10$4LUEjxM5afIrJ6zFTPNyMeXdi04TFXJ6FsqzwfMkvCNxeJ2vD2j8W','김싸피','','.',0,'',1),(30,'chan@naver.com','{bcrypt}$2a$10$y23gEYUCeS/8Q//9EdmBzeZ0P2.4IS1GIospm.bQ.FHwc8CNCxAGC','김찬민','EMP021',NULL,1,'010-0000-0002',1),(31,'chan1@naver.com','5676','김천민','EMP021',NULL,0,'010-0000-0010',1),(32,'chan2@naver.com','{bcrypt}$2a$10$S7rmfggyus1GNFpe69jCP.9zhfIp.13FGonMQIMU5L0MK2ffG/yE6','김천민','EMP021','75473bdf-f2b6-4aa8-816e-f1193b307544_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(33,'chan3@naver.com','{bcrypt}$2a$10$vDAFwB6o6LZEtdyStTlzdOW1BIPVVncj36XBekmUp9O0u5Hh8lGny','김천민','EMP021','b91474d5-3c1e-45de-be1c-60a009e50f04_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(34,'chan4@naver.com','{bcrypt}$2a$10$M./WU.Xo1U2ujXPH4mGHW.hu9MAprEJUzsNcnsQkLSSH6oZB.4B1y','김천민','EMP021','881b87d6-1ee1-4fb5-831f-27c2eaa0005e_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(36,'ttest@naver.com','{bcrypt}$2a$10$AslYm2wxTu9wMfJQSrCXaeSUqjFO4MNOduymYeNHV14MA7PYeRqH.','김태연','TY123','사용자 사진 경로',0,'010-4582-6505',1),(37,'chan5@naver.com','{bcrypt}$2a$10$QRjrIVOLBFSVTFGofP9H7eImdgU.1tjHmQTWYuwK0Q5W4oEP3a1Xy','김천민','EMP021','55a2a622-1811-4103-9d86-22397df3b13c_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(38,'chan6@naver.com','{bcrypt}$2a$10$KA7CkXCKtywzTsYUfLxP.uAO9jA.6f5bHHLNqmPy9LdwKAYG8btvG','김천민','EMP021','f6354f10-bb3d-4122-a28d-809e7ec2a7e0_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(39,'ttest2@naver.com','{bcrypt}$2a$10$bqAuFMAkl37wuUhyyIQ.tumYCG0zPvLeQU9kZbF5DkhJOU3b04L62','김태연','TY123','사용자 사진 경로',0,'010-4582-6505',1),(40,'new@naver.com','{bcrypt}$2a$10$4QnkCCW1bVxKihU5JEpDgOiMbFMmttmW9O4gANEfsiF5jLmpwE5.m','새로움','','.',0,'',1),(41,'new1@naver.com','{bcrypt}$2a$10$E29ycZnsvMCIiIubGFtkAePQqb8wNe/Zw8OHn/8qm0g1rAf72DhHW',NULL,'','.',0,'010-0000-0000',1),(42,'chan7@naver.com','{bcrypt}$2a$10$byFOi5PUE9Y0xe6dMcRg6u76rLUjxlLvz0K1ctnRlAeC5ZMvhVIMO','김천민','EMP021','db781705-901f-4583-afca-e738ca4d844c_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(43,'user30@naver.com','{bcrypt}$2a$10$WU6bUwj/HWjyVqNq/aG8p.YSJUvwQ7aP65qXzFIhcVo8aYSslr9lC','사용자명d','직원번호','사용자 사진 경로',0,'010-0000-7789',1),(44,'sw@naver.com','{bcrypt}$2a$10$u81BDS9gihC.eZJYg477lOopnMP3SqynlLVnReB4f4Au9iPCpE7T.','김싸피','','.',0,'',1),(45,'test@naver.com','{bcrypt}$2a$10$DK4osYruqurFvl8Yemkj/.WxvqkYKt6kS2zZtnjbPL3UQmFdBZCw.','김천민','EMP021',NULL,0,'010-0000-0000',1),(46,'test2@naver.com','{bcrypt}$2a$10$smXl5Oi/mrtVFMAg9mgffO41EvlzQSRYaw1AkgJeqhcpWvBNgbYAW','김천민','EMP021','e5ff69db-fbc5-49c3-8ead-18e2579d36e6_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(47,'sw1@naver.com','{bcrypt}$2a$10$MoH7wA/0G37FnSb6fZOYq.gaRiUUmp9v8Nr3oeo0dszaysoKxJuE.','영싸피','11',NULL,0,'010-0000-0000',1),(48,'sw2@naver.com','{bcrypt}$2a$10$Pt9adJ8MR430HL2Pp5fqUuQ1PhastCVZRvPEZNNUojhJNjVqZ1XKy','김싸피','11',NULL,0,'010-1234-5677',1),(49,'sw123@naver.com','{bcrypt}$2a$10$6LtD/2mag06/2HnBN4sDduod5xT7lwNbW59eirovJ1Mv4v4j4aL3.','김싸피','11',NULL,0,'010-1234-5676',1),(50,'sw1234@naver.com','{bcrypt}$2a$10$BMDipEUAXInQcE5Z/7b2U.5SZSVX4khdfWnj4BcXeQq84L2BuM6D2','김싸피','11',NULL,0,'010-1234-5676',1),(51,'alert@naver.com','{bcrypt}$2a$10$AKp0gTKEXh3gpEk9zPV2h..N90EkwqKHCO8lqvEj3lmgJK/xRaI9C','김싸피','11',NULL,0,'010-1234-5679',1),(52,'test3@naver.com','{bcrypt}$2a$10$.PrxV8m6KOSKOi6R2uKzR.q64vmH8wMTa0MuijH/VyJcF.SLm.9KW','김찬민','EMP021','98391152-6132-496b-a9ab-e0beab77c2e6_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(53,'sw5@naver.com','{bcrypt}$2a$10$NhimuryMOxMogKhV55LkQONJFd6U8QmoqPqg1mKtLND2fPgApSZg2','김싸피S','11',NULL,0,'010-1234-5678',1),(54,'sw1111@naver.com','{bcrypt}$2a$10$wBZ74TgoM7vawknxEKiUSOIMmM2GTBHzIzlcqvAoSzJyWrTEtc5OG','김싸피dddd','11',NULL,0,'010-1234-5676',1),(55,'test4@naver.com','{bcrypt}$2a$10$MSxRuGvq/UVlUC3PrCuGc.Zs5nUwvE6L4q0IaO.LoEiUfNW5KBZFu','김찬민','EMP021','ca9e7594-6f9a-482e-984a-9f6e56a29f74_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(56,'test5@naver.com','{bcrypt}$2a$10$51OTEjeuQBk3B3UX.2MD7O9CYKjZP0oljJQPeyrUxlHV1DniltmFm','김찬민','EMP021','0f85bb0c-c2c8-4020-ab91-9d5abc15d8d0_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(57,'sw9@naver.com','{bcrypt}$2a$10$h97s2i3lEc3qQzvH5Z.BCu4ysX/Ii.MrSsJRxWZpLjPzAMDjth4Iu',NULL,'11','40606fae-dbc0-4c01-b150-b9cf047bc414_캡처.PNG',0,'010-0000-0000',1),(58,'chantest1@naver.com','{bcrypt}$2a$10$h26Eq2n3J1HcNh4ftUZDeuBF3JlZfgaDSHI0JBy9MhfSkgpaRWTG6','김찬민','EMP021','65c50763-3bdb-4b3b-9b2a-831a55c02027_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(59,'chantest2@naver.com','{bcrypt}$2a$10$9VNtc8fV85h1FVIeVkxJTuc0VFbz6PcnkmTqwULHXniioGsF7caiy','김찬민','EMP021','391f2904-173d-4627-af04-2268372f3a7a_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(60,'chantest3@naver.com','{bcrypt}$2a$10$8G7XCZOs3UZxQwDJ6hG9F.wO3FwQS3k.S21MroNOkauohxmGPw19K','김찬민','EMP021','16ad78a0-6177-4c15-ae18-48b776814aa6_z8ljj9irkvrpoqhqdony.png',1,'010-0000-0010',1),(61,'admin@naver.com','{bcrypt}$2a$10$gu5LT9QHZQwxM31ooiCQweWKp1XnD10X/00p7Wz2SqVPmVbAzG.gi','어드민','EMP000','628163a0-2175-456b-9ad9-1501984f2cfa_z8ljj9irkvrpoqhqdony.png',1,'010-0000-0000',1),(62,'test@ssafy.com','{bcrypt}$2a$10$pA/DqAjM8hc/AuTX3rgFDe7KB.CIS1lW6X52ZDB6hbqhV8Lg2LyUG','강싸피','EMP33','3d86a712-d5ed-4f6f-874c-3fd9d39e21a4_캡처.PNG',0,'010-1234-0000',1),(63,'newuser@naver.com','{bcrypt}$2a$10$rU7QQeHZJr7IuT5U40dvM.b.erhZJmvy01Rjkj..qsPqO3.gbvTpy','김싸피','EMP34','b07e5280-4943-4223-8435-d4a3c0c4633c_캡처.PNG',0,'010-1234-1234',1),(64,'min@naver.com','{bcrypt}$2a$10$Dp8jKu.yMnYt4X80wbQ1lejRV/jLuvCm23mYsYXtusu634UYX0WwG','김찬민','EMP000','f3132e03-8842-4f76-abd9-6b4dacc70ab2_z8ljj9irkvrpoqhqdony.png',0,'010-0000-0000',1),(67,'min1@naver.com','{bcrypt}$2a$10$/2zvbUTKPzjma9Z3ak/MlupmL1UhsH1Iiy7pB5EqbPc7JmKq7Eed6','김찬민','EMP000','759339c0-ed57-4fda-bf27-4743e8aa54ac.webp',0,'010-0000-0000',1),(68,'min2@naver.com','{bcrypt}$2a$10$XoHtSVPUJ2p5nmDkyFKh0.M8IAS5qDQo9Wb3xOPDDCyAAxJzcKO7i','김찬민','EMP000','660e3732-cb3e-42f9-a2d9-829f8790548b.png',0,'010-0000-0000',1),(69,'min3@naver.com','{bcrypt}$2a$10$AVfzOcVlOxBPsSJJQP5dfeQuZ8QZXbQEwUi5hvLAdmG1t3CgmeUIS','김찬민','EMP000','831565ed-00d9-4be2-81ee-36d1169ad24e.png',0,'010-0000-0000',1),(70,'third@naver.com','{bcrypt}$2a$10$URPfk3fyYCFoB6YOBdFZMeA14xVEFbj7UL3M8etWO337Mc.2XFlUO','테스트','11','6c30718a-d94a-4b31-aad4-94f1744d3c59_캡처.PNG',0,'010-0000-7777',1),(71,'chan6=100@naver.com','{bcrypt}$2a$10$OUlYn8DUjGjQqafQ32HsiO6z5C4huOGQ5OOoL93nPYK/yfqGNAxLK','김천민ㅅㄷㄴㅅ','EMP021','b965ec86-247d-4e1a-91c3-4a20083e5923.png',0,'010-0000-0000',1),(72,'userTest@naver.com','{bcrypt}$2a$10$fs2QDRMH/f/Xo18BFeB7i.NA1ePkNzM739nhom2MOw1y6NdHh3Km.','김태연','EMP12334','사용자 사진 경로',0,'010-4582-6505',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Current Database: `o2o`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `o2o` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `o2o`;

--
-- Table structure for table `files`
--

DROP TABLE IF EXISTS `files`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `files` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `type` varchar(50) NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_USER_TO_FILES_1_idx` (`user_id`),
  CONSTRAINT `FK_USER_TO_FILES_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `files`
--

LOCK TABLES `files` WRITE;
/*!40000 ALTER TABLE `files` DISABLE KEYS */;
INSERT INTO `files` VALUES (1,1,'image/webp','76c35385-3b6e-4320-b502-f9a25e0fd65e지우개.webp','2024-08-15 10:27:59');
/*!40000 ALTER TABLE `files` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker`
--

DROP TABLE IF EXISTS `locker`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker` (
  `locker_id` int NOT NULL AUTO_INCREMENT,
  `body_id` int NOT NULL,
  `product_id` int DEFAULT NULL,
  `row` tinyint NOT NULL,
  `column` tinyint NOT NULL,
  `is_usable` tinyint(1) NOT NULL DEFAULT '1',
  `product_cnt` smallint DEFAULT '0',
  `total_cnt` smallint DEFAULT '0',
  PRIMARY KEY (`locker_id`),
  KEY `FK_LOCKER_BODY_TO_LOCKER_1` (`body_id`),
  KEY `FK_PRODUCT_TO_LOCKER_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_BODY_TO_LOCKER_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`),
  CONSTRAINT `FK_PRODUCT_TO_LOCKER_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker`
--

LOCK TABLES `locker` WRITE;
/*!40000 ALTER TABLE `locker` DISABLE KEYS */;
INSERT INTO `locker` VALUES (1,1,76,1,1,0,8,10),(2,1,3,2,1,0,7,10),(3,1,NULL,3,1,1,0,0),(4,2,4,1,1,0,4,6),(5,2,5,2,1,0,7,7),(6,2,NULL,3,1,1,0,0),(7,2,NULL,1,2,1,0,0),(8,2,NULL,2,2,1,0,0),(9,2,NULL,3,2,1,0,0),(10,2,NULL,1,3,1,0,0),(11,2,NULL,2,3,1,0,0),(12,2,NULL,3,3,1,0,0);
/*!40000 ALTER TABLE `locker` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker_body`
--

DROP TABLE IF EXISTS `locker_body`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker_body` (
  `body_id` int NOT NULL AUTO_INCREMENT,
  `body_location` varchar(50) NOT NULL,
  `row` tinyint NOT NULL,
  `column` tinyint NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1',
  PRIMARY KEY (`body_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker_body`
--

LOCK TABLES `locker_body` WRITE;
/*!40000 ALTER TABLE `locker_body` DISABLE KEYS */;
INSERT INTO `locker_body` VALUES (1,'3층 강의실',3,1,1),(2,'1층 로비',3,3,1);
/*!40000 ALTER TABLE `locker_body` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `product_id` int NOT NULL AUTO_INCREMENT,
  `product_nm` varchar(50) NOT NULL,
  `product_img` varchar(255) DEFAULT NULL,
  `product_det` varchar(500) DEFAULT NULL,
  `regist_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `user_id` int NOT NULL,
  PRIMARY KEY (`product_id`),
  KEY `FK_USER_TO_PRODUCT_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'가위',NULL,'평범한 가위','2024-08-14 06:36:49',1),(2,'마우스',NULL,'무선 마우스','2024-08-14 06:36:49',1),(3,'마우스',NULL,NULL,'2024-08-14 06:36:49',1),(4,'웹캠',NULL,'Full HD 웹캠','2024-08-14 06:36:49',1),(5,'삼각대',NULL,'카메라 삼각대','2024-08-14 06:36:49',1),(6,'전동 드릴',NULL,'무선 전동 드릴','2024-08-14 06:36:49',1),(7,'마이크',NULL,'USB 마이크','2024-08-14 06:36:49',1),(8,'디지털 카메라',NULL,'디지털 카메라','2024-08-14 06:36:49',1),(9,'HDMI 케이블',NULL,'고속 HDMI 케이블','2024-08-14 06:36:49',1),(10,'레이저 포인터',NULL,'레이저 포인터','2024-08-14 06:36:49',1),(23,'지우개',NULL,'연필을 사용하는 사람을 위한 지우개','2024-08-15 10:27:59',1),(33,'프로젝터',NULL,'고해상도 프로젝터','2024-08-14 06:36:49',1),(76,'가위',NULL,NULL,'2024-08-14 06:36:49',1);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_imgs`
--

DROP TABLE IF EXISTS `product_imgs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_imgs` (
  `product_id` int NOT NULL,
  `file_id` int NOT NULL,
  PRIMARY KEY (`product_id`,`file_id`),
  KEY `file_id` (`file_id`),
  CONSTRAINT `product_imgs_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `product_imgs_ibfk_2` FOREIGN KEY (`file_id`) REFERENCES `files` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_imgs`
--

LOCK TABLES `product_imgs` WRITE;
/*!40000 ALTER TABLE `product_imgs` DISABLE KEYS */;
INSERT INTO `product_imgs` VALUES (23,1);
/*!40000 ALTER TABLE `product_imgs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_req`
--

DROP TABLE IF EXISTS `product_req`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_req` (
  `req_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `product_nm` varchar(50) NOT NULL,
  `req_url` varchar(2048) DEFAULT NULL,
  `product_cnt` smallint DEFAULT '0',
  `req_content` varchar(500) DEFAULT NULL,
  `req_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_approved` tinyint(1) NOT NULL DEFAULT '0',
  `is_rejected` tinyint(1) NOT NULL DEFAULT '0',
  `reject_cmt` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`req_id`),
  KEY `FK_USER_TO_PRODUCT_REQ_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_REQ_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_req`
--

LOCK TABLES `product_req` WRITE;
/*!40000 ALTER TABLE `product_req` DISABLE KEYS */;
INSERT INTO `product_req` VALUES (1,1,'노트북',NULL,1,'신규 프로젝트 시작으로 고성능 노트북이 필요합니다. 16GB RAM, 512GB SSD 사양 요청드립니다.','2024-07-15 00:00:00',1,0,NULL),(2,1,'모니터',NULL,2,'디자인 작업 효율을 위해 27인치 4K 해상도 모니터 2대를 신청합니다. 색 정확도가 높은 모델로 부탁드립니다.','2024-07-16 00:00:00',1,0,NULL),(3,1,'키보드',NULL,1,'장시간 타이핑으로 인한 손목 통증 예방을 위해 인체공학 분리형 키보드를 요청합니다.','2024-07-17 00:00:00',0,1,NULL),(4,1,'마우스',NULL,1,'그래픽 작업용 고정밀 무선 마우스가 필요합니다. DPI 조절 기능이 있는 모델로 부탁드립니다.','2024-07-18 00:00:00',0,1,NULL),(5,1,'헤드셋',NULL,1,'고객 상담 품질 향상을 위해 노이즈 캔슬링 기능이 탑재된 프리미엄 헤드셋을 신청합니다.','2024-07-19 00:00:00',0,0,NULL);
/*!40000 ALTER TABLE `product_req` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_rpt`
--

DROP TABLE IF EXISTS `product_rpt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_rpt` (
  `rpt_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `product_id` int NOT NULL,
  `product_cnt` smallint DEFAULT '0',
  `rpt_content` varchar(1000) DEFAULT NULL,
  `rpt_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `rpt_img` varchar(255) DEFAULT NULL,
  `is_processed` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`rpt_id`),
  KEY `FK_USER_TO_PRODUCT_RPT_1` (`user_id`),
  KEY `FK_LOCKER_TO_PRODUCT_RPT_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` (`status_id`),
  KEY `FK_PRODUCT_TO_PRODUCT_RPT_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_TO_PRODUCT_RPT_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_PRODUCT_RPT_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_RPT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_rpt`
--

LOCK TABLES `product_rpt` WRITE;
/*!40000 ALTER TABLE `product_rpt` DISABLE KEYS */;
INSERT INTO `product_rpt` VALUES (1,2,4,4,4,1,'웹캠 한 개 분실하였습니다.','2024-08-15 09:44:19',NULL,1),(2,2,4,7,4,1,'웹캠 한 개 렌즈가 파손되었습니다.','2024-08-15 09:44:34',NULL,0),(3,2,1,6,1,1,'세부 사항','2024-08-15 13:16:56','물품 이미지',0);
/*!40000 ALTER TABLE `product_rpt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_status`
--

DROP TABLE IF EXISTS `product_status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_status` (
  `status_id` tinyint NOT NULL,
  `status_nm` varchar(10) NOT NULL COMMENT '분류(1. 대여 2. 예약 3. 배부 4. 등록 5. 수리 6. 분실 7. 파손)',
  PRIMARY KEY (`status_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_status`
--

LOCK TABLES `product_status` WRITE;
/*!40000 ALTER TABLE `product_status` DISABLE KEYS */;
INSERT INTO `product_status` VALUES (1,'대여'),(2,'예약'),(3,'배부'),(4,'등록'),(5,'수리'),(6,'분실'),(7,'파손'),(8,'반납'),(9,'예약취소'),(10,'예약만료');
/*!40000 ALTER TABLE `product_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent`
--

DROP TABLE IF EXISTS `rent`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent` (
  `rent_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `reserve_id` int DEFAULT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `end_dt` datetime DEFAULT NULL,
  `is_returned` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`rent_id`),
  KEY `FK_USER_TO_RENT_1` (`user_id`),
  KEY `FK_RESERVE_TO_RENT_1` (`reserve_id`),
  CONSTRAINT `FK_RESERVE_TO_RENT_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RENT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent`
--

LOCK TABLES `rent` WRITE;
/*!40000 ALTER TABLE `rent` DISABLE KEYS */;
INSERT INTO `rent` VALUES (13,2,NULL,'2024-08-15 09:43:44','2024-08-18 09:43:44','2024-08-15 09:45:54',1),(14,2,NULL,'2024-08-12 09:48:12','2024-08-15 09:48:12','2024-08-16 01:22:23',1),(15,2,NULL,'2024-08-15 13:14:50','2024-08-18 13:14:50','2024-08-15 13:16:56',1),(16,2,NULL,'2024-08-15 13:15:03','2024-08-18 13:15:03','2024-08-16 01:22:31',1),(17,3,NULL,'2024-08-16 00:49:22','2024-08-19 00:49:22','2024-08-16 01:22:54',1),(18,3,NULL,'2024-08-16 00:49:48','2024-08-19 00:49:48','2024-08-16 01:23:02',1),(19,2,NULL,'2024-08-16 01:14:21','2024-08-19 01:14:21','2024-08-16 01:23:10',1),(20,2,NULL,'2024-08-16 01:24:34','2024-08-19 01:24:34','2024-08-16 01:45:23',1),(21,2,NULL,'2024-08-16 01:27:28','2024-08-19 01:27:28','2024-08-16 01:45:26',1),(22,2,NULL,'2024-08-16 01:28:42','2024-08-19 01:28:42','2024-08-16 01:45:29',1),(23,2,NULL,'2024-08-16 01:30:48','2024-08-19 01:30:48','2024-08-16 01:45:36',1),(24,3,NULL,'2024-08-16 03:08:11','2024-08-19 03:08:11','2024-08-16 03:10:33',1),(25,2,NULL,'2024-08-16 03:12:02','2024-08-19 03:12:02','2024-08-16 03:34:42',1),(26,3,NULL,'2024-08-16 03:13:56','2024-08-19 03:13:56','2024-08-16 03:34:57',1),(27,2,NULL,'2024-08-16 05:16:19','2024-08-19 05:16:19','2024-08-16 05:18:03',1),(28,2,NULL,'2024-08-16 06:24:43','2024-08-19 06:24:43',NULL,0);
/*!40000 ALTER TABLE `rent` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent_log`
--

DROP TABLE IF EXISTS `rent_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent_log` (
  `log_id` int NOT NULL AUTO_INCREMENT,
  `rent_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `product_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `log_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`log_id`),
  KEY `FK_RENT_TO_RENT_LOG_1` (`rent_id`),
  KEY `FK_LOCKER_TO_RENT_LOG_1` (`locker_id`),
  KEY `FK_PRODUCT_TO_RENT_LOG_1` (`product_id`),
  KEY `FK_PRODUCT_STATUS_TO_RENT_LOG_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RENT_LOG_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RENT_LOG_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RENT_LOG_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RENT_TO_RENT_LOG_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent_log`
--

LOCK TABLES `rent_log` WRITE;
/*!40000 ALTER TABLE `rent_log` DISABLE KEYS */;
INSERT INTO `rent_log` VALUES (3,13,4,4,1,3,'2024-08-15 09:43:44'),(4,13,4,4,4,1,'2024-08-15 09:44:19'),(5,13,4,4,7,1,'2024-08-15 09:44:34'),(6,13,4,4,8,1,'2024-08-15 09:45:54'),(7,14,5,5,1,2,'2024-08-12 09:48:12'),(8,15,1,1,1,1,'2024-08-15 13:14:50'),(9,16,1,1,1,2,'2024-08-15 13:15:03'),(10,16,2,2,1,1,'2024-08-15 13:15:03'),(11,15,1,1,6,1,'2024-08-15 13:16:56'),(12,17,1,1,1,1,'2024-08-16 00:49:22'),(13,18,1,1,1,1,'2024-08-16 00:49:48'),(14,19,1,1,1,1,'2024-08-16 01:14:21'),(15,14,5,5,8,2,'2024-08-16 01:22:23'),(16,16,1,1,8,2,'2024-08-16 01:22:31'),(17,16,2,2,8,1,'2024-08-16 01:22:31'),(18,17,1,1,8,1,'2024-08-16 01:22:54'),(19,18,1,1,8,1,'2024-08-16 01:23:02'),(20,19,1,1,8,1,'2024-08-16 01:23:10'),(21,20,1,76,1,1,'2024-08-16 01:24:34'),(22,21,1,76,1,1,'2024-08-16 01:27:28'),(23,22,1,76,1,1,'2024-08-16 01:28:42'),(24,23,2,3,1,1,'2024-08-16 01:30:48'),(25,20,1,76,8,1,'2024-08-16 01:45:23'),(26,21,1,76,8,1,'2024-08-16 01:45:26'),(27,22,1,76,8,1,'2024-08-16 01:45:29'),(28,23,1,3,8,1,'2024-08-16 01:45:36'),(29,24,1,76,1,1,'2024-08-16 03:08:11'),(30,24,2,3,1,1,'2024-08-16 03:08:11'),(31,24,2,3,8,1,'2024-08-16 03:10:33'),(32,24,1,76,8,1,'2024-08-16 03:10:33'),(33,25,1,76,1,1,'2024-08-16 03:12:02'),(34,25,2,3,1,1,'2024-08-16 03:12:02'),(35,26,1,76,1,1,'2024-08-16 03:13:56'),(36,26,2,3,1,1,'2024-08-16 03:13:56'),(37,26,1,76,8,1,'2024-08-16 03:16:05'),(38,25,1,76,8,1,'2024-08-16 03:34:39'),(39,25,1,3,8,1,'2024-08-16 03:34:42'),(41,26,2,3,8,1,'2024-08-16 03:34:57'),(42,27,1,76,1,1,'2024-08-16 05:16:19'),(43,27,2,3,1,1,'2024-08-16 05:16:19'),(44,27,2,3,8,1,'2024-08-16 05:18:03'),(45,27,1,76,8,1,'2024-08-16 05:18:03'),(46,28,1,76,1,1,'2024-08-16 06:24:43'),(47,28,2,3,1,1,'2024-08-16 06:24:43'),(48,28,1,76,8,1,'2024-08-16 06:26:56');
/*!40000 ALTER TABLE `rent_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve`
--

DROP TABLE IF EXISTS `reserve`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve` (
  `reserve_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `body_id` int NOT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `is_ended` tinyint(1) NOT NULL DEFAULT '0',
  `end_dt` datetime DEFAULT NULL,
  `is_canceled` tinyint(1) NOT NULL DEFAULT '0',
  `is_taken` tinyint(1) NOT NULL DEFAULT '0',
  `rent_id` int DEFAULT NULL,
  PRIMARY KEY (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_1` (`user_id`),
  KEY `FK_RENT_TO_RESERVE_1` (`rent_id`),
  KEY `FK_LOCKERBODY_TO_RESERVE_1_idx` (`body_id`),
  CONSTRAINT `FK_LOCKERBODY_TO_RESERVE_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `FK_RENT_TO_RESERVE_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve`
--

LOCK TABLES `reserve` WRITE;
/*!40000 ALTER TABLE `reserve` DISABLE KEYS */;
INSERT INTO `reserve` VALUES (1,2,1,'2024-08-15 10:22:40','2024-08-15 21:30:00',1,'2024-08-15 21:30:00',0,0,NULL),(2,2,1,'2024-08-15 12:58:44','2024-08-16 00:00:00',1,'2024-08-15 13:41:05',1,0,NULL),(3,2,1,'2024-08-15 12:58:59','2024-08-16 00:00:00',1,'2024-08-15 12:59:35',1,0,NULL),(4,3,1,'2024-08-16 00:21:55','2024-08-17 00:00:00',0,NULL,0,0,NULL),(5,3,1,'2024-08-16 04:14:29','2024-08-17 00:00:00',0,NULL,0,0,NULL),(6,2,1,'2024-08-16 06:23:21','2024-08-17 00:30:00',0,NULL,0,0,NULL);
/*!40000 ALTER TABLE `reserve` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve_det`
--

DROP TABLE IF EXISTS `reserve_det`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve_det` (
  `det_id` int NOT NULL AUTO_INCREMENT,
  `reserve_id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `det_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`det_id`),
  KEY `FK_RESERVE_TO_RESERVE_DET_1` (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_DET_1` (`user_id`),
  KEY `FK_PRODUCT_TO_RESERVE_DET_1` (`product_id`),
  KEY `FK_LOCKER_TO_RESERVE_DET_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RESERVE_DET_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RESERVE_DET_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RESERVE_TO_RESERVE_DET_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_DET_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve_det`
--

LOCK TABLES `reserve_det` WRITE;
/*!40000 ALTER TABLE `reserve_det` DISABLE KEYS */;
INSERT INTO `reserve_det` VALUES (1,1,2,1,1,2,2,'2024-08-15 10:22:40'),(2,1,2,2,2,2,1,'2024-08-15 10:22:40'),(3,2,2,1,1,2,1,'2024-08-15 12:58:44'),(4,3,2,2,2,2,1,'2024-08-15 12:58:59'),(5,4,3,1,1,2,1,'2024-08-16 00:21:55'),(6,5,3,76,1,2,1,'2024-08-16 04:14:29'),(7,6,2,76,1,2,1,'2024-08-16 06:23:21');
/*!40000 ALTER TABLE `reserve_det` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `user_lgid` varchar(50) NOT NULL COMMENT '이메일 ex) ID@naver.com',
  `user_pw` varchar(100) NOT NULL,
  `user_nm` varchar(10) NOT NULL,
  `emp_cd` varchar(20) NOT NULL,
  `user_img` varchar(255) DEFAULT NULL,
  `is_admin` tinyint(1) NOT NULL DEFAULT '0',
  `user_tel` varchar(20) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1' COMMENT '탈퇴 여부',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'chan@ssafy.com','{bcrypt}$2a$10$fs2QDRMH/f/Xo18BFeB7i.NA1ePkNzM739nhom2MOw1y6NdHh3Km.','김찬민','1',NULL,1,'010-1111-1111',1),(2,'ty@ssafy.com','{bcrypt}$2a$10$fs2QDRMH/f/Xo18BFeB7i.NA1ePkNzM739nhom2MOw1y6NdHh3Km.','김태연','2',NULL,0,'010-2222-2222',1),(3,'ssafy@ssafy.com','{bcrypt}$2a$10$785RYAkZcQ3x1U3XUDuQB.IwzkOYW60U38Jvl88X.u/OHBoY.cZsq','남은식','EMP003','ae995d5f-7008-4416-bc7a-43f1e61a0c68.jpg',0,'010-0000-0000',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Current Database: `o2o_test`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `o2o_test` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `o2o_test`;

--
-- Table structure for table `files`
--

DROP TABLE IF EXISTS `files`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `files` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `type` varchar(50) NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_USER_TO_FILES_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_FILES_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `files`
--

LOCK TABLES `files` WRITE;
/*!40000 ALTER TABLE `files` DISABLE KEYS */;
INSERT INTO `files` VALUES (1,1,'image/png','9a7b5e74-9c22-44a0-9d57-b47b394c3995가위.png','2024-08-09 15:49:18'),(2,1,'image/webp','cbb5299b-b342-4a5a-8cad-ee62c7c060c1eraser.webp','2024-08-12 01:19:15'),(3,1,'image/png','ad9d3670-a167-4a1e-9d19-b08c17c5294e가위.png','2024-08-12 01:19:15'),(4,1,'image/png','40b90721-63af-48a5-8679-d1e54f23392e가위.png','2024-08-12 10:01:14');
/*!40000 ALTER TABLE `files` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker`
--

DROP TABLE IF EXISTS `locker`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker` (
  `locker_id` int NOT NULL AUTO_INCREMENT,
  `body_id` int NOT NULL,
  `product_id` int DEFAULT NULL,
  `column` tinyint NOT NULL,
  `row` tinyint NOT NULL,
  `is_usable` tinyint(1) NOT NULL DEFAULT '1',
  `product_cnt` smallint DEFAULT '0',
  `total_cnt` smallint DEFAULT '0',
  PRIMARY KEY (`locker_id`),
  KEY `FK_LOCKER_BODY_TO_LOCKER_1` (`body_id`),
  KEY `FK_PRODUCT_TO_LOCKER_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_BODY_TO_LOCKER_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`),
  CONSTRAINT `FK_PRODUCT_TO_LOCKER_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker`
--

LOCK TABLES `locker` WRITE;
/*!40000 ALTER TABLE `locker` DISABLE KEYS */;
INSERT INTO `locker` VALUES (1,1,1,3,3,1,4,4),(2,1,1,3,3,1,4,4);
/*!40000 ALTER TABLE `locker` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `locker_body`
--

DROP TABLE IF EXISTS `locker_body`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locker_body` (
  `body_id` int NOT NULL AUTO_INCREMENT,
  `body_location` varchar(50) NOT NULL,
  `column` tinyint NOT NULL,
  `row` tinyint NOT NULL,
  `is_active` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`body_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locker_body`
--

LOCK TABLES `locker_body` WRITE;
/*!40000 ALTER TABLE `locker_body` DISABLE KEYS */;
INSERT INTO `locker_body` VALUES (1,'1층 복도',3,3,NULL),(2,'2층 복도',3,3,NULL),(3,'3층 복도',3,3,NULL);
/*!40000 ALTER TABLE `locker_body` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `product_id` int NOT NULL AUTO_INCREMENT,
  `product_nm` varchar(50) NOT NULL,
  `product_img` varchar(255) DEFAULT NULL,
  `product_det` varchar(500) DEFAULT NULL,
  `regist_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `user_id` int NOT NULL,
  PRIMARY KEY (`product_id`),
  KEY `FK_USER_TO_PRODUCT_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'가위',NULL,'','2024-08-09 15:49:18',1),(2,'바위',NULL,'평범한 바위','2024-08-12 01:18:57',1),(3,'바위',NULL,'평범한 바위','2024-08-12 01:19:15',1);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_imgs`
--

DROP TABLE IF EXISTS `product_imgs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_imgs` (
  `product_id` int NOT NULL,
  `file_id` int NOT NULL,
  KEY `FK_PRODUCT_TO_PRODUCT_IMGS_1` (`product_id`),
  KEY `FK_FILES_TO_PRODUCT_IMGS_1` (`file_id`),
  CONSTRAINT `FK_FILES_TO_PRODUCT_IMGS_1` FOREIGN KEY (`file_id`) REFERENCES `files` (`id`),
  CONSTRAINT `FK_PRODUCT_TO_PRODUCT_IMGS_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_imgs`
--

LOCK TABLES `product_imgs` WRITE;
/*!40000 ALTER TABLE `product_imgs` DISABLE KEYS */;
INSERT INTO `product_imgs` VALUES (1,1),(3,2),(3,3);
/*!40000 ALTER TABLE `product_imgs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_req`
--

DROP TABLE IF EXISTS `product_req`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_req` (
  `req_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `product_nm` varchar(50) NOT NULL,
  `req_url` varchar(2048) DEFAULT NULL,
  `product_cnt` smallint DEFAULT '0',
  `req_content` varchar(500) DEFAULT NULL,
  `req_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `is_approved` tinyint(1) NOT NULL DEFAULT '0',
  `is_rejected` tinyint(1) NOT NULL DEFAULT '0',
  `reject_cmt` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`req_id`),
  KEY `FK_USER_TO_PRODUCT_REQ_1` (`user_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_REQ_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_req`
--

LOCK TABLES `product_req` WRITE;
/*!40000 ALTER TABLE `product_req` DISABLE KEYS */;
INSERT INTO `product_req` VALUES (1,1,'건전지','https://www.gmarket.co.kr/',150,'gmarket에서 건전지 사주세요','2024-08-09 14:46:55',1,0,'승인 이유'),(2,1,'가위','https://www.gmarket.co.kr/',150,'gmarket에서 가위 사주세요','2024-08-09 14:47:46',0,1,NULL),(4,1,'건전지','https://www.gmarket.co.kr/',150,'gmarket에서 건전지 사주세요','2024-08-15 20:12:13',0,0,NULL),(5,1,'건전지','https://www.gmarket.co.kr/',150,'gmarket에서 건전지 사주세요','2024-08-15 20:17:52',0,0,NULL);
/*!40000 ALTER TABLE `product_req` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_rpt`
--

DROP TABLE IF EXISTS `product_rpt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_rpt` (
  `rpt_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `product_id` int NOT NULL,
  `product_cnt` smallint DEFAULT '0',
  `rpt_content` varchar(1000) DEFAULT NULL,
  `rpt_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `rpt_img` varchar(255) DEFAULT NULL,
  `is_processed` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`rpt_id`),
  KEY `FK_USER_TO_PRODUCT_RPT_1` (`user_id`),
  KEY `FK_LOCKER_TO_PRODUCT_RPT_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` (`status_id`),
  KEY `FK_PRODUCT_TO_PRODUCT_RPT_1` (`product_id`),
  CONSTRAINT `FK_LOCKER_TO_PRODUCT_RPT_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_PRODUCT_RPT_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_PRODUCT_RPT_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_USER_TO_PRODUCT_RPT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_rpt`
--

LOCK TABLES `product_rpt` WRITE;
/*!40000 ALTER TABLE `product_rpt` DISABLE KEYS */;
/*!40000 ALTER TABLE `product_rpt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_status`
--

DROP TABLE IF EXISTS `product_status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_status` (
  `status_id` tinyint NOT NULL,
  `status_nm` varchar(10) NOT NULL COMMENT '분류(1. 대여2. 예약3. 배부4. 등록 5. 수리6. 분실7. 파손)',
  PRIMARY KEY (`status_id`,`status_nm`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_status`
--

LOCK TABLES `product_status` WRITE;
/*!40000 ALTER TABLE `product_status` DISABLE KEYS */;
INSERT INTO `product_status` VALUES (1,'대여'),(2,'예약'),(3,'배부'),(4,'등록'),(5,'수리'),(6,'분실'),(7,'파손');
/*!40000 ALTER TABLE `product_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent`
--

DROP TABLE IF EXISTS `rent`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent` (
  `rent_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `reserve_id` int DEFAULT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `end_dt` datetime DEFAULT NULL,
  `is_returned` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`rent_id`),
  KEY `FK_USER_TO_RENT_1` (`user_id`),
  KEY `FK_RESERVE_TO_RENT_1` (`reserve_id`),
  CONSTRAINT `FK_RESERVE_TO_RENT_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RENT_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent`
--

LOCK TABLES `rent` WRITE;
/*!40000 ALTER TABLE `rent` DISABLE KEYS */;
/*!40000 ALTER TABLE `rent` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rent_log`
--

DROP TABLE IF EXISTS `rent_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rent_log` (
  `log_id` int NOT NULL AUTO_INCREMENT,
  `rent_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `product_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `log_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`log_id`),
  KEY `FK_RENT_TO_RENT_LOG_1` (`rent_id`),
  KEY `FK_LOCKER_TO_RENT_LOG_1` (`locker_id`),
  KEY `FK_PRODUCT_TO_RENT_LOG_1` (`product_id`),
  KEY `FK_PRODUCT_STATUS_TO_RENT_LOG_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RENT_LOG_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RENT_LOG_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RENT_LOG_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RENT_TO_RENT_LOG_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rent_log`
--

LOCK TABLES `rent_log` WRITE;
/*!40000 ALTER TABLE `rent_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `rent_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve`
--

DROP TABLE IF EXISTS `reserve`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve` (
  `reserve_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `body_id` int NOT NULL,
  `start_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `due_dt` datetime NOT NULL,
  `is_ended` tinyint(1) NOT NULL DEFAULT '0',
  `end_dt` datetime DEFAULT NULL,
  `is_canceled` tinyint(1) NOT NULL DEFAULT '0',
  `is_taken` tinyint(1) NOT NULL DEFAULT '0',
  `rent_id` int DEFAULT NULL,
  PRIMARY KEY (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_1` (`user_id`),
  KEY `FK_LOCKER_BODY_TO_RESERVE_1` (`body_id`),
  KEY `FK_RENT_TO_RESERVE_1` (`rent_id`),
  CONSTRAINT `FK_LOCKER_BODY_TO_RESERVE_1` FOREIGN KEY (`body_id`) REFERENCES `locker_body` (`body_id`),
  CONSTRAINT `FK_RENT_TO_RESERVE_1` FOREIGN KEY (`rent_id`) REFERENCES `rent` (`rent_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve`
--

LOCK TABLES `reserve` WRITE;
/*!40000 ALTER TABLE `reserve` DISABLE KEYS */;
INSERT INTO `reserve` VALUES (12,1,1,'2024-08-09 17:01:34','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(13,1,1,'2024-08-09 17:01:35','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(14,1,1,'2024-08-09 17:01:37','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(15,1,1,'2024-08-09 17:01:38','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(16,1,1,'2024-08-09 17:01:39','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(17,1,1,'2024-08-09 17:01:40','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL),(18,1,1,'2024-08-09 17:01:41','2024-08-10 17:00:00',1,'2024-08-12 01:30:00',0,0,NULL);
/*!40000 ALTER TABLE `reserve` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reserve_det`
--

DROP TABLE IF EXISTS `reserve_det`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reserve_det` (
  `det_id` int NOT NULL AUTO_INCREMENT,
  `reserve_id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `locker_id` int NOT NULL,
  `status_id` tinyint NOT NULL,
  `det_cnt` smallint NOT NULL DEFAULT '0',
  `log_dt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`det_id`),
  KEY `FK_RESERVE_TO_RESERVE_DET_1` (`reserve_id`),
  KEY `FK_USER_TO_RESERVE_DET_1` (`user_id`),
  KEY `FK_PRODUCT_TO_RESERVE_DET_1` (`product_id`),
  KEY `FK_LOCKER_TO_RESERVE_DET_1` (`locker_id`),
  KEY `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` (`status_id`),
  CONSTRAINT `FK_LOCKER_TO_RESERVE_DET_1` FOREIGN KEY (`locker_id`) REFERENCES `locker` (`locker_id`),
  CONSTRAINT `FK_PRODUCT_STATUS_TO_RESERVE_DET_1` FOREIGN KEY (`status_id`) REFERENCES `product_status` (`status_id`),
  CONSTRAINT `FK_PRODUCT_TO_RESERVE_DET_1` FOREIGN KEY (`product_id`) REFERENCES `product` (`product_id`),
  CONSTRAINT `FK_RESERVE_TO_RESERVE_DET_1` FOREIGN KEY (`reserve_id`) REFERENCES `reserve` (`reserve_id`),
  CONSTRAINT `FK_USER_TO_RESERVE_DET_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reserve_det`
--

LOCK TABLES `reserve_det` WRITE;
/*!40000 ALTER TABLE `reserve_det` DISABLE KEYS */;
INSERT INTO `reserve_det` VALUES (7,12,1,1,2,2,1,'2024-08-09 17:01:34'),(8,13,1,1,2,2,1,'2024-08-09 17:01:35'),(9,14,1,1,2,2,1,'2024-08-09 17:01:37'),(10,15,1,1,2,2,1,'2024-08-09 17:01:38'),(11,16,1,1,2,2,1,'2024-08-09 17:01:39'),(12,17,1,1,2,2,1,'2024-08-09 17:01:40');
/*!40000 ALTER TABLE `reserve_det` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `user_lgid` varchar(50) NOT NULL COMMENT '이메일 ex) ID@naver.com',
  `user_pw` varchar(100) DEFAULT NULL,
  `user_nm` varchar(10) NOT NULL,
  `emp_cd` varchar(20) NOT NULL,
  `user_img` varchar(255) DEFAULT NULL,
  `is_admin` tinyint(1) NOT NULL DEFAULT '0',
  `user_tel` varchar(20) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1' COMMENT '탈퇴 여부',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'chan@naver.com','{bcrypt}$2a$10$wFxNCQxlW8wHDK9XeVJTrO1SE86ALFYJkZpddR2gIzDVcPZVJThHy','김찬민','EMP000','96a88d6a-b61f-4302-a479-da124d877292.png',1,'010-0000-0000',1),(2,'chan1@naver.com','{bcrypt}$2a$10$blN0nS/ij.LGywI/BUtKiOUY21E67kgISkyEprtLnSzy1slTnDOKm','김찬민','EMP000','484753ff-58cb-4e12-8af2-54c65634ba27.png',1,'010-0000-0000',1),(3,'chan3@naver.com','{bcrypt}$2a$10$.oTiHvjQQvSrsd//DES1AO8s/WuDHJ75UxL6lLgP96F8PldquC9aC','김찬민','EMP000','f0a66b30-e3a5-4297-a20f-1d8a8836ae5d.png',0,'010-0000-0000',1),(4,'image1@naver.com','{bcrypt}$2a$10$y.g3oDW/kF3d6OpOtd9UTuUgmHwp5x6y4bhIqAKIEw5gPPKTeFX5m','김찬민','EMP000','7c25ea4e-7769-4153-bfd4-5f6beb9ce7b4.png',0,'010-0000-0000',1),(5,'image2@naver.com','{bcrypt}$2a$10$rniW6HIBFNDkKTYCvE60UuVBs699PPOGzMSYAK7EQKWkIfpMIzu.S','김찬민','EMP000','44dda92f-633a-4f6f-aea4-1fab72faee60.png',0,'010-0000-0000',1),(6,'image3@naver.com','{bcrypt}$2a$10$aUzcRq1/EJFHxnDcLe9yuuFL5CQQy25I318TXn0M7lwZdqCc7h8KS','김찬민','EMP000','4f91a5c7-3836-4e88-b9e9-93e794a31303.png',0,'010-0000-0000',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-08-16 17:47:00
